{
  "Name": "Core Business Application - SAP Security Maturity Model",
  "ShortName": "CBAS-SAPSMM",
  "Version": "0.8",
  "Description": "The SAP Security Maturity Model is a definition of controls to help SAP using organizations, security professionals,  service providers, tool vendors to define, test and verify the security of business critical SAP infrastructures.",
  "Controls": [
    {
      "Shortcode": "DT-P-AE-M01-003",
      "Security Function": "DT",
      "CSF Category": "Anomalien und Ereignisse",
      "Technology": "SAP ERP",
      "Maturity Level": "1",
      "IPAC": [
        "P"
      ],
      "Defender": [
        "Prozess"
      ],
      "Prerequisites": [],
      "Description": "\nSystemprotokolle:\n\nDas Erkennen und Sammeln von Systemproblemen anhand von Systemprotokollen ist wichtig, damit das System mit guter Leistung läuft. Indem Sie Ihr System gesund erhalten und am Laufen halten, vermeiden Sie fehlerbedingte Serviceunterbrechungen.\n\n",
      "Implementation": "\nUnabhängig davon, ob Ihr Unternehmen einen UNIX- oder Windows-Host betreibt, sollten die Systemprotokolle regelmäßig überprüft werden. Es wird empfohlen, die Protokolle an einen zentralen Ort zu speichern, um zu vermeiden, dass Protokolle überschrieben werden, sobald der Puffer voll ist; insbesondere bei Windows-Hosts.\n\nSie können Warnmeldungen konfigurieren, wenn ein bestimmtes Ereignis eintritt oder ein Schwellenwert erreicht wird. Dies trägt dazu bei, den Überprüfungsprozess von Systemprotokollen zu automatisieren und die Arbeitsbelastung der Administratoren zu verringern. Das Versenden von Protokollen an eine zentrale Stelle hilft bei der Einrichtung von Alarmen.\n\n",
      "Verification": [
        "",
        "- Prüfen Sie Systemprotokolle über die Transaktion SM21.",
        "- Konfigurieren Sie Alarme für bestimmte Ereignisse wie Rollbacks und Systemfehlermeldungen, um reaktiv zu reagieren und Probleme zu beheben"
      ],
      "References": []
    },
    {
      "Shortcode": "PT-P-AC-M01-001",
      "Security Function": "PT",
      "CSF Category": "Benutzerverwaltung, Authentifizierung und Zugriffskontrolle",
      "Technology": "Betriebssystem",
      "Maturity Level": "1",
      "IPAC": [
        "P"
      ],
      "Defender": [
        "Technologie"
      ],
      "Prerequisites": [],
      "Description": "\nDie Autorisierung, die Berechtigung und der Zugriff für SAP-Standardbenutzer müssen innerhalb des verwendeten Betriebssystems ordnungsgemäß gesichert und konfiguriert werden.\n",
      "Implementation": "\nWie lokale Benutzer und Domänenbenutzer auf einem Windows-Rechner müssen auch SAP-Standardbenutzer über die entsprechenden Rechte und Berechtigungen innerhalb des Betriebssystems verfügen.\n\n- Beschränken Sie den Zugriff auf die Benutzer root, SAPsid und dbsid auf jedem System\n- Sperren Sie den Benutzer dbsid nach der Erstinstallation für alle Anwendungsdienste\n- SAPsid sollte keine Rechte für die interaktive Anmeldung haben\n\nHinweis: SAP-Systeme dürfen nicht auf Domänencontrollern installiert werden.\n",
      "Verification": [
        "",
        "- Überprüfen Sie, dass das SAP-System nicht auf dem Domänencontroller installiert ist.",
        "- Überprüfen Sie, ob alle Einschränkungen für SAP-Benutzer in Kraft sind.",
        ""
      ],
      "References": [
        "- BSI APP.4.2 SAP-ERP-System, APP.4.2.A16 Implementierung von Sicherheitsanforderungen für das Betriebssystem Windows (S) / Umsetzung von Sicherheitsanforderungen für das Betriebssystem Windows (S)",
        "- BSI APP.4.2 SAP-ERP-System, APP.4.2.A17 Implementierung von Sicherheitsanforderungen für das Betriebssystem Unix (S) / Umsetzung von Sicherheitsanforderungen für das Betriebssystem Unix (S)",
        "- CIS CSC 3, 5, 12, 14, 15, 16, 18",
        "- COBIT 5 DSS05.04",
        "- ISA 62443-2-1:2009 4.3.3.7.3",
        "- ISA 62443-3-3:2013 SR 2.1",
        "- ISO/IEC 27001:2013 A.6.1.2, A.9.1.2, A.9.2.3, A.9.4.1, A.9.4.4, A.9.4.5",
        "- NIST SP 800-53 Rev. 4 AC-1, AC-2, AC-3, AC-5, AC-6, AC-14, AC-16, AC-24"
      ]
    },
    {
      "Shortcode": "PT-I-IP-M01-001",
      "Security Function": "PT",
      "CSF Category": "Prozesse und Verfahren zum Schutz von Informationen",
      "Technology": "SAP ABAP",
      "Maturity Level": "1",
      "IPAC": [
        "I"
      ],
      "Defender": [
        "Prozess"
      ],
      "Prerequisites": [
        ""
      ],
      "Description": "\nUm die Remote Function Call (RFC)-Schnittstelle, die als Kommunikationsschnittstelle zwischen SAP-Systemen verwendet wird, richtig abzusichern, müssen alle RFC-Verbindungen, RFC-Berechtigungen und RFC-Schnittstellen berücksichtigt werden.\n",
      "Implementation": "\nFür alle RFC-Verbindungen muss eine einheitliche Verwaltungsvorgabe vorhanden sein; Eigentum und Nutzung der RFC-Verbindung sollten eindeutig dokumentiert sein. Außerdem muss ein vollständiges Inventar für alle RFC-Verbindungen definiert und dokumentiert werden.\n\nAlle RFC-Verbindungen, die nicht verwendet werden, müssen gelöscht werden. (Die Dokumentation sollte dies ebenfalls widerspiegeln)\n\n",
      "Verification": [
        "",
        "- Feststellen, ob eine RFC-Verbindung verwendet wird, indem Sie die RFC-Laufzeitmonitor-Transaktion SRTM oder die Workload-Monitor-Transaktion ST03N verwenden.",
        "- Löschen Sie alle nicht verwendeten RFC-Verbindungen.",
        "- Vorgaben in Bezug auf bestehende RFC-Verbindungen sind verfügbar und auf dem neuesten Stand."
      ],
      "References": [
        "- BSI APP.4.2 SAP-ERP-System, APP.4.2.A8 Absicherung der SAP-RFC-Schnittstelle/ Absicherung der SAP-RFC-Schnittstelle",
        "- SAP Security Baseline Template V2.0: 2.3.2.3"
      ]
    },
    {
      "Shortcode": "PT-I-PT-M01-003",
      "Security Function": "PT",
      "CSF Category": "Schutztechnik",
      "Technology": "SAProuter",
      "Maturity Level": "1",
      "IPAC": [
        "I"
      ],
      "Defender": [
        "Technologie"
      ],
      "Prerequisites": [],
      "Description": "\nJede Kommunikation mit oder zwischen verschiedenen SAP-Systemen muss verschlüsselt werden. Mit Secure Network Communication (SNC) können Sie die Kommunikation zwischen verschiedenen Systemen verschlüsseln.\n\nSNC kann nur mit SAP-Protokollen verwendet werden. Alle anderen Internetprotokolle sollten durch Aktivierung von TLS geschützt werden.\n",
      "Implementation": "\nStellen Sie sicher, dass Sie die Public Key Infrastructure (PKI) kennen und verstehen, bevor Sie fortfahren.\n\nDie Steuerung veranschaulicht, wie Sie den SAProuter für die Verwendung von SNC konfigurieren.\n\n- Laden Sie die CommonCryptoLib vom SAP-Supportportal herunter und extrahieren Sie sie.\n\n- Setzen Sie die Umgebungsvariable SNC_LIB = \\<Pfad zur CommonCryptoLib\\>.\n\n- Setzen Sie die Umgebungsvariable SECUDIR = \\<Saprouter-Verzeichnis\\>/sec\n\n- Signieren Sie ein Zertifikat für Ihren SAProuter über eine Zertifizierungsstelle (CA) Ihres Vertrauens oder über SAP\n\n- Erzeugen Sie Ihre persönlichen Sicherheitsumgebungsdateien (PSE), indem Sie den folgenden Befehl dort ausführen, wo Sie Ihre SAProuter-Dateien abgelegt haben. *sapgenpse get_pse -v -a sha256WithRsaEncryption -s 2048 -r \\<csrfile\\> -p local.pse -x \\<password\\> \"CN=\\<Ihr spezifisches CN\\>\"*. \\<csrfile\\> ist der von Ihnen gewählte Dateiname, der für Ihre Certificate Signing Request (CSR) verwendet werden soll.\n\n- Senden Sie die Datei \\<csrfile\\> an Ihre Zertifizierungsstelle (CA), um das Zertifikat zu erhalten und fortzufahren\n\n- Kopieren Sie den Inhalt des empfangenen Zertifikats in eine Datei auf Ihrem SAProuter-System und importieren Sie es mit dem folgenden Befehl *sapgenpse import_own_cert -c \\<certca\\> -r \\<root CA certificate\\> -p local.pse*. \\<certca\\> ist die von Ihrer CA erhaltene Datei und \\<Stammzertifikat der CA\\> ist das Stammzertifikat der CA\n\n- Erzeugen Sie die Datei mit den Anmeldeinformationen mit dem folgenden Befehl *sapgenpse seclogin -p local.pse \\<pse password\\>*.\n\n- Test, um zu prüfen, ob alles korrekt konfiguriert und installiert ist *sapgenpse get_my_name -v -n Issuer*.\n\n- Setzen Sie eine ACL in Ihrer saprouttab-Datei, um SNC-Verbindungen zuzulassen.\n\n- Starten Sie den SAProuter mit seinem SNC-Namen\n\nUm die Kommunikation mit externen SAP-Produkten, wie z.B. SAP Single Sign-On, zu sichern, sollten Sie die Sicherheitshinweise für dieses spezielle Produkt beachten.\n\nHinweis: Vor SAP NetWeaver 7.40 wird die Registerkarte SNC nur angezeigt, wenn der Parameter snc/enable aktiviert ist.\n",
      "Verification": [
        "",
        "- Überprüfen Sie, ob alles korrekt konfiguriert und installiert ist *sapgenpse get_my_name -v -n Issuer*.",
        "- Überprüfen Sie die ACL-Datei (saprouttab), um zu überprüfen, ob SNC-Verbindungen erlaubt sind.",
        ""
      ],
      "References": [
        "- BSI APP.4.2 SAP-ERP-System, APP.4.2.A18 Abschaltung von unsicherer Kommunikation/ Disconnection of unsafe communication",
        "- CIS CSC 8, 12, 15",
        "- COBIT 5 DSS05.02, APO13.01",
        "- ISA 62443-3-3:2013 SR 3.1, SR 3.5, SR 3.8, SR 4.1, SR 4.3, SR 5.1, SR 5.2, SR 5.3, SR 7.1, SR 7.6",
        "- ISO/IEC 27001:2013 A.13.1.1, A.13.2.1, A.14.1.3",
        "- NIST SP 800-53 Rev. 4 AC-4, AC-17, AC-18, CP-8, SC-7, SC-19, SC-20, SC-21, SC-22, SC-23, SC-24, SC-25, SC-29, SC-32, SC-36, SC-37, SC-38, SC-39, SC-40, SC-41, SC-43"
      ]
    },
    {
      "Shortcode": "DT-P-AE-M01-007",
      "Security Function": "DT",
      "CSF Category": "Anomalien und Ereignisse",
      "Technology": "SAP ERP",
      "Maturity Level": "1",
      "IPAC": [
        "P"
      ],
      "Defender": [
        "Prozess"
      ],
      "Prerequisites": [],
      "Description": "\nBenutzerinformationssystem:\n\nEin wichtiges Werkzeug für die interne und externe Prüfung. Es hilft bei der Identifizierung von Anomalien in verschiedenen Listen, die im Benutzerinformationstool gefunden werden.\n",
      "Implementation": "\nEs wird empfohlen, die verschiedenen Informationen, die über das Benutzerinformationssystem verfügbar sind, regelmäßig zu überprüfen, um Ihr SAP-System in Übereinstimmung mit internen Richtlinien oder externen Vorschriften zu halten und alle Änderungen zu ermitteln, die nicht intern genehmigt wurden.\n\nVerwendung:\n- Pflege von kritischen Berechtigungen und Berechtigungskombinationen\n- Prüfung der Benutzer, denen kritische oder sensible Berechtigungen zugewiesen sind\n- Prüfung welche Transaktionen in bestimmten Rollen enthalten sind\n- Rollen, Benutzer, Profile und Berechtigungen in einem einzelnen System oder systemübergreifend vergleichen\n- Prüfung von Änderungsbelegen für das Berechtigungsprofil von Benutzern, Sicherheitsrichtlinien und ZBV-Einstellungen.\n\n",
      "Verification": [
        "",
        ""
      ],
      "References": [
        "- [SAP Support](https://help.sap.com/doc/saphelp_nw73ehp1/7.31.19/en-US/52/671261439b11d1896f0000e8322d00/content.htm?no_cache=true)"
      ]
    },
    {
      "Shortcode": "IY-C-RA-M01-003",
      "Security Function": "IY",
      "CSF Category": "Risikobewertung",
      "Technology": "ABAP",
      "Maturity Level": "1",
      "IPAC": [
        "C"
      ],
      "Defender": [
        "Prozess"
      ],
      "Prerequisites": [],
      "Description": "\nSchutz von sicherheitsrelevanten Daten.\n\nSAP-Systeme enthalten große Mengen an geschäftskritischen Daten. Das SAP-Standardsystem bietet verschiedene Mechanismen, um diese kritischen Daten vor unberechtigtem Zugriff zu schützen.\nFehler in kundenspezifischen Entwicklungen können jedoch unbefugte Zugriffe und Datenverluste ermöglichen. Wenn sich ein Mitarbeiter unbefugt Zugang zu Daten verschafft, kann er diese Daten anschließend in eine Umgebung übertragen, die vom Unternehmen nicht mehr kontrolliert werden kann.\n\n",
      "Implementation": "\n1. Die Spezifikation der Änderung enthält eine knappe Beschreibung der erforderlichen Datenschutzanpassungen gemäß der Änderung.\n\n2. Im Rahmen des Code Change Review-Prozesses muss der gesamte benutzerdefinierte Code auf folgende Eigenschaften überprüft werden:\n  - Geschäftskritische Daten werden durch das Programm vor unbefugtem Zugriff geschützt werden.\n  - Unternehmensregeln und insbesondere gesetzliche Vorschriften beachtet werden:\n    - Umgang mit Anmeldedaten Diese Anforderungen an den Datenschutz müssen insbesondere bei der Verarbeitung und Verwaltung von Anmeldedaten beachtet werden. Dazu gehören neben Login-Tokens, Passwörtern und anderen möglichen Authentifizierungsfaktoren auch Benutzernamen und Identitätsinformationen von Benutzern. Authentifizierungsmerkmale müssen bei der Speicherung, der Übertragung und bei der Eingabe den Anforderungen strengster Vertraulichkeit genügen. Zum Beispiel:\n      - Das Speichern von Kennwörtern im Quelltext von Programmen ist ein Verstoß gegen diese Anforderung.\n      - Die Anzeige von Kennwörtern im Klartext auf Anmeldebildschirmen ist ein Verstoß gegen diese Anforderung.\n      - Das Speichern von Passwörtern im Klartext in Datenbanktabellen oder im Datensystem ist ein Verstoß gegen diese Anforderung.\n    Identitätsinformationen müssen auch in den von der Software erstellten Protokoll- und Ereignisdaten mit besonderer Sorgfalt gegen unbefugte und unangemessene Zugriffe geschützt werden.\n",
      "Verification": [
        "",
        "- Überprüfung, ob die Datenschutzanforderungen spezifiziert und dokumentiert sind und ihre Überprüfung im Testprotokoll der Änderung dokumentiert ist.",
        "- Prüfen Sie, ob die Überprüfung des Quellcodes bei allen benutzerdefinierten Codeänderungen auf die korrekte Umsetzung der Datenschutzkriterien durchgeführt und dokumentiert wird."
      ],
      "References": [
        "",
        "- CIS CSC 4",
        "- COBIT 5 APO12.01, APO12.02, APO12.03, APO12.04",
        "- ISA 62443-2-1:2009 4.2.3, 4.2.3.9, 4.2.3.12",
        "- ISO/IEC 27001:2013 Klausel 6.1.2",
        "- NIST SP 800-53 Rev. 4 RA-3, SI-5, PM-12, PM-16",
        "- OWASP ASVS 2.0 V8.3.1, V8.3.4"
      ]
    },
    {
      "Shortcode": "PT-A-AC-M01-011",
      "Security Function": "PT",
      "CSF Category": "Benutzerverwaltung, Authentifizierung und Zugriffskontrolle",
      "Technology": "SAP ABAP",
      "Maturity Level": "1",
      "IPAC": [
        "A"
      ],
      "Defender": [
        "Technologie"
      ],
      "Prerequisites": [],
      "Description": "\nEs wird empfohlen, Single Sign-On (SSO) zu konfigurieren, wenn mehrere SAP-Systeme in der Umgebung des Unternehmens laufen. SSO kann den Prozess der Verwaltung und Konfiguration von Benutzerberechtigungen für mehrere Systeme und Anwendungen vereinfachen. Einem einzelnen Benutzer den Zugriff auf mehrere Anwendungen zu gestatten, birgt eigene Sicherheitsrisiken und Bedrohungen; eine sichere Konfiguration der ausgestellten Anmeldetickets muss vorhanden sein, um potenzielle Bedrohungen zu vermeiden.  \n",
      "Implementation": "\nUm ausgestellte Anmeldetickets während des Transports in ABAP-basierten Systemen zu schützen, müssen die folgenden Profilparameter vorhanden sein.  \n\n- Verwenden Sie HTTPS, indem Sie login/ticket_only_by_https = 1 setzen.\n- Um sicherzustellen, dass das Anmeldeticket an den erstellenden Host zurückgeschickt wird, setzen Sie login/ticket_only_to_host = 1\n- Deklarieren Sie ein Cookie als HTTPonly, indem Sie icf/set_HTTPonly_flag_on_cookies = 1 oder 3 setzen. Dadurch wird anderen Anwendungen wie Applets, Plug-ins usw. der Zugriff auf das ausgestellte Cookie vom Webbrowser des Clients verweigert.\n\n\nHinweis: Diese Kontrolle setzt voraus, dass SSO in der Organisation bereits konfiguriert ist und verwendet wird.\n",
      "Verification": [
        "",
        "- Überprüfen Sie, ob der HTTPS-Profilparameter gesetzt ist, indem Sie login/ticket_only_by_https überprüfen.",
        "- Überprüfen Sie, ob nur der erstellende Host das Anmeldeticket erhält, indem Sie login/ticket_only_to_host überprüfen.",
        "- Prüfen Sie, ob der Profilparameter icf/set_HTTPonly_flag_on_cookies = 1 oder 3 ist.",
        ""
      ],
      "References": [
        "- BSI APP.4.2 SAP-ERP-System, APP.4.2.A31 Konfiguration von SAP Single-Sign-On (S) / Konfiguration von SAP Single-Sign-On (S)",
        "- SAP Security Baseline Template V2.1: 2.3.2.4.1"
      ]
    },
    {
      "Shortcode": "PT-A-AC-M01-001",
      "Security Function": "PT",
      "CSF Category": "Benutzerverwaltung, Authentifizierung und Zugriffskontrolle",
      "Technology": "SAP ABAP",
      "Maturity Level": "1",
      "IPAC": [
        "A"
      ],
      "Defender": [
        "Prozess"
      ],
      "Prerequisites": [],
      "Description": "\nDie SAP-Benutzerverwaltung sollte nur ausgewählten Administratoren gestattet sein und über die entsprechenden Rechte verfügen, um die Erstellung, das Löschen, die Zuweisung von Rollen und Profilen sowie die Passwortverwaltung von Benutzern durchzuführen.\n",
      "Implementation": "\nRechte zur Verwaltung von Benutzern in SAP sollten nur an Benutzer vergeben werden, die dieselbe Jobrolle haben oder von der Organisation ausgewählt wurden(1).\n\nDie Protokollierung und Überwachung von SAP-Administratoren erleichtert die Identifizierung von administrativem Missbrauch.\n\n(1) - Die meisten Benutzeradministratoren kommen aus der IT-Abteilung eines Unternehmens. Einige Unternehmen überlassen die Benutzerverwaltung der Personalabteilung, was vorzuziehen ist.\n\n",
      "Verification": [
        "",
        "- Identifizieren Sie die SAP-Benutzeradministratoren und überprüfen Sie, ob diese Rollen nur erlaubten Benutzern zugewiesen werden.",
        "- Protokolle sind verfügbar, um den Missbrauch von administrativen Aktionen zu überprüfen",
        "- Überwachung ist verfügbar, um jeglichen Missbrauch bei der Benutzerverwaltung aufzudecken"
      ],
      "References": [
        "- BSI APP.4.2 SAP-ERP-System, APP.4.2.A5 Konfiguration und Absicherung der SAP-Benutzerverwaltung / Konfiguration und Absicherung der SAP-Benutzerverwaltung",
        "- SAP Security Baseline Template V2.1: 2.3.1",
        "- CIS CSC 1, 5, 15, 16",
        "- COBIT 5 DSS05.04, DSS06.03",
        "- ISA 62443-2-1:2009 4.3.3.5.1",
        "- ISA 62443-3-3:2013 SR 1.1, SR 1.2, SR 1.3, SR 1.4, SR 1.5, SR 1.7, SR 1.8, SR 1.9",
        "- ISO/IEC 27001:2013 A.9.2.1, A.9.2.2, A.9.2.3, A.9.2.4, A.9.2.6, A.9.3.1, A.9.4.2, A.9.4.3",
        "- NIST SP 800-53 Rev. 4 AC-1, AC-2, IA-1, IA-2, IA-3, IA-4, IA-5, IA-6, IA-7, IA-8, IA-9, IA-10, IA-11"
      ]
    },
    {
      "Shortcode": "PT-P-DS-M01-003",
      "Security Function": "PT",
      "CSF Category": "Datensicherheit",
      "Technology": "SAP Java",
      "Maturity Level": "1",
      "IPAC": [
        "P"
      ],
      "Defender": [
        "Technologie"
      ],
      "Prerequisites": [],
      "Description": "\nUm die Menge an Informationen zu reduzieren, die bei der Auskundschaftung durch Angreifer offengelegt werden, wird empfohlen, alle Informationen zur Systemversion oder detaillierte Fehlerprotokolle zu entfernen, die gesammelt werden können, um mögliche Schwachstellen auszunutzen, die sich aus diesen Informationen ergeben könnten.\n",
      "Implementation": "\nUm eine beliebige Version aus dem SAP Java-System Ihres Unternehmens zu entfernen, setzen Sie die Einstellung UseServerHeader sowohl im HTTP-Providerdienst (globale Konfiguration des Dispatchers) als auch in den Serverknoten auf false.\n\n",
      "Verification": [
        "",
        "- Setzen Sie UserServerHeader im HTTP-Provider-Dienst in der globalen Konfiguration des Dispatchers auf false.",
        "- Setzen Sie UserServerHeader in den Server-Knoten auf false."
      ],
      "References": [
        "- BSI APP.4.2 SAP-ERP-System, APP.4.2.A1 Sichere Konfiguration des SAP-ABAP-Stacks (B) / Secure Konfiguration des SAP-ABAP-Stacks (B)",
        "- SAP Security Baseline Template V2.1: 2.2.1.2.2"
      ]
    },
    {
      "Shortcode": "PT-I-IP-M01-005",
      "Security Function": "PT",
      "CSF Category": "Prozesse und Verfahren zum Schutz von Informationen",
      "Technology": "SAP ABAP",
      "Maturity Level": "1",
      "IPAC": [
        "I"
      ],
      "Defender": [
        "Technologie"
      ],
      "Prerequisites": [],
      "Description": "\nRFC-Gateways sind häufig auf ABAP-, Java- und Standalone-Systemen zu finden. Die Sicherung des Zugriffs auf die RFC-Dienste verhindert den unauthentifizierten und nicht-berechtigten Zugriff.\n",
      "Implementation": "\nFür die verschiedenen Systeme sollten Profilparameter festgelegt werden, um den Zugriff von verschiedenen RFC-Verbindungen aus zu beschränken.\n\nProfil-Parameter:\n\n1. gw/sec_info muss auf Dateiname secinfo (ACL-Datei) gesetzt werden\n2. gw/reg_info muss auf den Dateinamen reginfo (ACL-Datei) gesetzt werden\n3. gw/reg_no_conn_info auf 1 oder höhere ungerade Zahlen gesetzt\n4. gw/acl_mode auf 1 gesetzt (anfängliche Sicherheitsumgebung), wenn Gateway-Zugriffslisten nicht existieren oder nicht mit den Profilparametern verknüpft sind, kann das Setzen dieses Profilparameters Verbindungen unterbrechen.\n5. gw/monitor auf 1 gesetzt (Überwachung nur auf lokalen Zugriff eingestellt)\n6. gw/sim_mode auf 0 gesetzt (kann vorübergehend auf 1 gesetzt werden, um ACL-Dateien zu testen und fehlende Einträge zu finden, die der ACL hinzugefügt werden müssen. Belassen Sie den Wert nicht auf 1)\n7. gw/rem_start auf disable oder SSH_SHELL gesetzt (eine akzeptable Methode, um den Start von Programmen über das RFC-Gateway zu ermöglichen)\n",
      "Verification": [
        "",
        "- Profilparameter werden gemäß dem Abschnitt zur Implementierung eingestellt",
        "- Fehlende Einträge werden überprüft und wenn nötig der Zugriffskontrollliste hinzugefügt (siehe Nr. 6 im Abschnitt zur Implementierung)"
      ],
      "References": [
        "- BSI APP.4.2 SAP-ERP-System, APP.4.2.A8 Absicherung der SAP-RFC-Schnittstelle/ Absicherung der SAP-RFC-Schnittstelle",
        "- SAP Security Baseline Template V2.0: 2.3.2.3.1",
        "- SAP-Hinweis 1480644",
        "- SAP-Hinweis 1408081",
        "- SAP-Hinweis 1444282",
        "- SAP-Hinweis 1298433",
        "- SAP-Hinweis 64016",
        "- SAP-Hinweis 1689663"
      ]
    },
    {
      "Shortcode": "DT-P-AE-M01-006",
      "Security Function": "DT",
      "CSF Category": "Anomalien und Ereignisse",
      "Technology": "SAP ERP",
      "Maturity Level": "1",
      "IPAC": [
        "P"
      ],
      "Defender": [
        "Prozess"
      ],
      "Prerequisites": [],
      "Description": "\nProtokollierung des Lesezugriffs:\n\nEin wichtiges Tool zur Überwachung und Aufzeichnung von Lesezugriffen auf geheime oder sensible Daten in SAP-Systemen. Das Tool hilft bei der Untersuchung einer Sicherheitsverletzung oder eines Informationslecks.  \n\n",
      "Implementation": "\nDie folgenden Konfigurationsschritte müssen durchgeführt werden, um die Protokollierung des Read Access Logs (RAL) zu überwachen und zu konfigurieren.\n\n1. Bestimmen Sie, welche Art von Daten über RAL protokolliert werden soll\n2. Erklären Sie einen Zweck für die Protokollierung der Daten, um Daten mit regulatorischer Relevanz zu identifizieren.\n3. Definieren Sie die zu überwachenden Schnittstellen mittels RAL channels\n4. Definieren Sie die Log-Domänen der verschiedenen Kanäle\n5. Definieren Sie die Bedingungen für die Zugrifssprotokollierung\n\n",
      "Verification": [
        "",
        "- Konfigurieren und überwachen Sie die Protokollierung des Lesezugriffs über die Transaktion SRALMANAGER"
      ],
      "References": []
    },
    {
      "Shortcode": "IY-C-RA-M01-002",
      "Security Function": "IY",
      "CSF Category": "Risikobewertung",
      "Technology": "ABAP",
      "Maturity Level": "1",
      "IPAC": [
        "C"
      ],
      "Defender": [
        "Prozess"
      ],
      "Prerequisites": [],
      "Description": "\nTestbarkeit von ABAP-Software-Implementierungen.\n\nEin zentrales Sicherheitskonzept des SAP-Standardsystems ist die Trennung von Entwicklungs-, Test- und Produktivsystemen.\nDas Testsystem spielt dabei eine wichtige Rolle. Im Testsystem wird die Entscheidung getroffen, ob eine Anwendung den Anforderungen des Unternehmens gerecht wird. Dabei werden sowohl funktionale als auch nicht-funktionale Qualitätsaspekte der Anwendung geprüft. Damit eine Qualitätsprüfung zuverlässige Ergebnisse liefert, reicht es nicht aus, dass der Tester über umfassende Fachkenntnisse im Bereich der Qualitätssicherung verfügt. Die Anwendung selbst muss auch testbar sein. Das bedeutet, dass ein Tester die Anwendung zu Testzwecken ausführen kann und dass der Tester im Zweifelsfall den Quellcode der Anwendung analysieren kann.\n\nWenn eine bestimmte Funktionalität in einer Anwendung nicht (von einem Tester) im Testsystem ausgeführt werden kann, kann der Tester nicht feststellen, ob sie die Qualitätsanforderungen erfüllt. In diesem Fall würde ungeprüfter Code in ein produktives System übertragen werden und das System einem ungeprüften Risiko aussetzen.\n",
      "Implementation": "\n1. Alle Eigenentwicklungen, die in Systemen zur Verarbeitung produktiver Daten eingesetzt werden sollen, müssen testbar sein. Das bedeutet, dass alle Funktionen dokumentiert sind und in einem Testsystem analysiert und ausgeführt werden können.\n\n2. Kundenspezifische Entwicklungen, die nicht in Systemen zur Verarbeitung produktiver Daten verwendet werden sollten, dürfen nicht in entsprechende Systemen ausgeliefert werden\n\n3. Im Rahmen der Überprüfung von Codeänderungen muss der gesamte benutzerdefinierte Code daraufhin überprüft werden, dass:\n  - die Sicherheitsanforderungen mit standardisierten und nachvollziehbaren Verfahren umgesetzt werden. Verschleierung keine valide Sicherheitsstrategie.\n  - die Änderung eine Architektur implementiert und  Schnittstellen so verwendet, dass Sicherheitsmechanismen zum Schutz der Geschäftslogik nicht durch Seiteneffekte oder durch die Wiederverwendung von Komponenten der Implementierung umgangen werden können.\n  - eine Techniken zur Codeverschleierung wie die ab ABAP Release 7.4x verfügbare Funktion zum Verbergen von Code verwendet wird.\n  - die Implementierung sich nicht darauf beschränkt, Code auf der Grundlage von systemspezifischen Variablen wie sy-mandt und sy-sysid auszuführen. Dadurch erhält ein ABAP-Programm die Informationen über das ausführende System, in dem es gerade ausgeführt wird, den die Tests für Zielsystem nicht entsprechend simulieren können.\n",
      "Verification": [
        "",
        "- Prüfen Sie, ob Testausführungskriterien und -pfade festgelegt und dokumentiert sind und ihre Ausführung im Testprotokoll der Änderung dokumentiert ist.",
        "- Prüfen Sie, ob die Überprüfung des Quellcodes für alle benutzerdefinierten Codeänderungen durchgeführt und dokumentiert wird, um die korrekte Implementierung der Testbarkeit in der Änderung zu gewährleisten."
      ],
      "References": [
        "",
        "- CIS CSC 4",
        "- COBIT 5 APO12.01, APO12.02, APO12.03, APO12.04",
        "- ISA 62443-2-1:2009 4.2.3, 4.2.3.9, 4.2.3.12",
        "- ISO/IEC 27001:2013 Klausel 6.1.2",
        "- NIST SP 800-53 Rev. 4 RA-3, SI-5, PM-12, PM-16",
        "- BSI APP (Februar 2020) 4.6 A16, A21"
      ]
    },
    {
      "Shortcode": "PT-A-AC-M01-010",
      "Security Function": "PT",
      "CSF Category": "Benutzerverwaltung, Authentifizierung und Zugriffskontrolle",
      "Technology": "SAP HANA",
      "Maturity Level": "1",
      "IPAC": [
        "A"
      ],
      "Defender": [
        "Technologie"
      ],
      "Prerequisites": [],
      "Description": "\nSAP-Standardbenutzer müssen verwaltet und sicher konfiguriert werden, um jeglichen Missbrauch von SAP-Systemen zu verhindern. Dazu gehört das Ändern von Standardpasswörtern und die Einschränkung von Standardbenutzern.\n",
      "Implementation": "\nDie folgenden Standardbenutzer, die in HANA zu finden sind, müssen verwaltet und sicher konfiguriert werden: (Der Abschnitt Überprüfung der Maßnahme hilft Unternehmen, die grundlegenden Anforderungen für die Sicherheit der Benutzer zu erfüllen)\n1. SYSTEM\n\n",
      "Verification": [
        "",
        "- SYSTEM",
        "  - Administrator-Benutzer wurden erstellt",
        "  - SYSTEM-Benutzer soll deaktiviert werden",
        "  - Gültige Zeitspanne des Benutzers SYSTEM nicht einschränken"
      ],
      "References": [
        "- BSI APP.4.2 SAP-ERP-System, APP.4.2.A4 Konfiguration und Absicherung der SAP-Benutzerverwaltung / Konfiguration und Absicherung der SAP-Benutzerverwaltung",
        "- SAP Security Baseline Template V2.1: 2.3.1.2.2"
      ]
    },
    {
      "Shortcode": "PT-P-DS-M01-002",
      "Security Function": "PT",
      "CSF Category": "Datensicherheit",
      "Technology": "SAP ABAP",
      "Maturity Level": "1",
      "IPAC": [
        "P"
      ],
      "Defender": [
        "Technologie"
      ],
      "Prerequisites": [
        ""
      ],
      "Description": "\nUm die Menge an Informationen, die bei der Auskundschaftung durch Angreifer offengelegt werden, zu reduzieren, wird empfohlen, alle Informationen zur Systemversion oder detaillierte Fehlerprotokolle zu entfernen, die gesammelt werden können, um mögliche Schwachstellen auszunutzen, die sich aus diesen Informationen ergeben könnten.\n",
      "Implementation": "\nUm alle detaillierten Fehler aus dem SAP ABAP-System Ihres Unternehmens zu entfernen, setzen Sie den Profilparameter login/show_detailed_errors auf 0.\n\nVerwenden Sie die nachstehenden Parameter, um die Parameter anzuzeigen und zu ändern:\n\n- RZ11-Transaktion: zum Anzeigen von Informationen über Parameter\n- RZ10-Transaktion: zum Anzeigen und Ändern von Profilparametern\n- RSPARAM-Bericht zum Anzeigen von Parametern (verwenden Sie Transaktion SA38)\n\n",
      "Verification": [
        "",
        "- Profilparameter login/show_detailed_errors=0"
      ],
      "References": [
        "- BSI APP.4.2 SAP-ERP-System, APP.4.2.A1 Sichere Konfiguration des SAP-ABAP-Stacks (B) / Secure Konfiguration des SAP-ABAP-Stacks (B)",
        "- SAP Security Baseline Template V2.1: 2.2.1.2.1"
      ]
    },
    {
      "Shortcode": "DT-P-AE-M01-002",
      "Security Function": "DT",
      "CSF Category": "Anomalien und Ereignisse",
      "Technology": "SAP ERP",
      "Maturity Level": "1",
      "IPAC": [
        "P"
      ],
      "Defender": [
        "Prozess"
      ],
      "Prerequisites": [],
      "Description": "\nProtokolle der Sicherheitsüberprüfung:\n\nDie Identifizierung und Erfassung sicherheitsrelevanter Aktivitäten ist wichtig für die Sammlung von Beweisen nach einem Sicherheitsvorfall oder Ereignis. Das Sicherheitsprotokoll kann sensible Daten enthalten, die ordnungsgemäß gespeichert und verschlüsselt werden müssen.  \n",
      "Implementation": "\nDie Aktivierung von Sicherheitsauditprotokollen hängt davon ab, welche Protokolle Ihr Unternehmen sammeln möchte. Die verfügbaren Protokolle sind unten aufgeführt:\n\n- Erfolgreiche und erfolglose Dialog-Anmeldeversuche\n- Erfolgreiche und erfolglose RFC-Anmeldeversuche\n- RFCs zu Funktionsbausteinen\n- Änderungen an Benutzerstammsätzen\n- Erfolgreiche und erfolglose Transaktionsstarts\n- Erfolgreiche und erfolglose Reportstarts\n- Änderungen an der Audit-Konfiguration\n- Aktivierung und Deaktivierung der HTTP-Sicherheitssitzungsverwaltung oder Instanzen, in denen HTTP-Sicherheitsabschnitte hart verlassen wurden\n- Datei-Downloads\n- Zugriffe auf das Dateisystem, die mit den im System angegebenen gültigen logischen Pfaden und Dateinamen übereinstimmen (besonders hilfreich in einer Analysephase, um festzustellen, wo der Zugriff auf Dateien stattfindet, bevor die eigentliche Überprüfung aktiviert wird)\n- ICF-Recorder-Einträge oder Änderungen an den Verwaltungseinstellungen\n- Die Valididerung von digitalen Signaturen, die vom System durchgeführt werden\n- Viren, die von der Viren-Scan-Schnittstelle gefunden wurden\n- Fehler, die in der Viren-Scan-Schnittstelle auftreten\n- Erfolglose Passwortprüfungen für einen bestimmten Benutzer in einem bestimmten Client\n\nPersonenbezogene Daten können in bestimmten Sicherheitsprotokollen zu finden sein. Achten Sie darauf, dass Sie bei der Speicherung personenbezogener Daten alle Datenschutzbestimmungen einhalten, die für Ihr Unternehmen gelten.\n\nWarnungen können konfiguriert werden, wenn ein bestimmtes Ereignis eintritt oder ein Schwellenwert erreicht wird. Dies trägt dazu bei, den Überprüfungsprozess von Sicherheitsauditprotokollen zu automatisieren und die Arbeitsbelastung der Administratoren zu verringern. Das Versenden von Protokollen an eine zentrale Stelle hilft bei der Einrichtung von Alarmen.\n",
      "Verification": [
        "",
        "- Konfigurieren Sie Alarme für wichtige Ereignisse, um reaktiv auf Sicherheitsereignisse zu reagieren",
        ""
      ],
      "References": []
    },
    {
      "Shortcode": "PT-I-PT-M01-002",
      "Security Function": "PT",
      "CSF Category": "Schutztechnik",
      "Technology": "SAProuter",
      "Maturity Level": "1",
      "IPAC": [
        "I"
      ],
      "Defender": [
        "Technologie"
      ],
      "Prerequisites": [],
      "Description": "\nWenn Sie SAPGUI- oder RFC-Verbindungen verwenden, um vom Internet oder von verschiedenen externen Netzwerken aus auf veröffentlichte SAP-Systeme zuzugreifen, die zu Ihrem Unternehmen gehören, muss SAProuter ordnungsgemäß konfiguriert werden, um den Datenverkehr zuzulassen und zu verweigern. Der SAProuter muss auch mit der Firewall Hand in Hand arbeiten, um verschiedene Zugriffsregeln zu übernehmen und eine Multi-Access-Control-Architektur zu ermöglichen.\n",
      "Implementation": "\nDie Implementierung sicherer Verbindungen von externen Netzwerken oder dem Internet aus erfordert eine kontinuierliche Abstimmung und Anpassung, um unbefugten Zugriff auf SAP-Systeme zu verhindern. Die unten stehende Implementierung ist eine Basis, die es Unternehmen ermöglicht, sichere Verbindungen zu ihren internen Systemen zu implementieren.\n\n- Konfigurieren Sie Ihre Firewall so, dass sie nur einen Port zulässt, 32NN, wobei NN die Instanznummer des Unternehmens für den SAProuter ist.\n- Konfigurieren Sie SNC(1), um dem SAP-Support eine sichere Anmeldung an Ihrem System zu ermöglichen. (Dies ist hauptsächlich für Supportzwecke gedacht)\n- Konfigurieren Sie ein implizites Deny in der letzten Zeile der ACL-Datei (routtab-Datei), (Verweigern Sie jeglichen Datenverkehr mit der folgenden Regel D * * *)\n- Konfigurieren Sie autorisierte Verbindungen über SAPGUI, um SAProuter für die Verbindung zu verwenden\n- Für den Fall, dass eine Verbindung von nicht verwalteten Geräten erforderlich ist, konfigurieren Sie eine bestimmte autorisierte Verbindung mit Hilfe eines sicheren Passworts (Aktualisieren Sie die routtab-Datei, z.B. P * * 3201 secure_password, erlaubt Anfragen an Port 3201, wenn ein Kennwort verwendet wird)\n- Kontinuierliche Überwachung des dev_route-Protokolls. Dies ermöglicht es den Sicherheitsteams, ihre ACLs auf ihre Bedürfnisse abzustimmen.\n\n\n(1) - Referenzsteuerung PT-I-PT-M01-003 zur Konfiguration und Aktivierung von SNC\n",
      "Verification": [
        "",
        "- Überprüfen Sie die ACL-Datei (routtab), um unerwünschte oder falsch konfigurierte Regeln zuzuweisen.",
        "- Überprüfen Sie, ob in der ACL-Datei eine implizite Verweigerung vorhanden ist (d.h. D * * *)",
        "- Überprüfen Sie, ob ein sicheres Passwort für autorisierten Datenverkehr konfiguriert ist.",
        "- Überprüfen Sie, ob Verbindungen, die von SAPGUI kommen, so konfiguriert sind, dass sie den SAProuter benutzen.",
        "- Überprüfen Sie, ob die Firewall so konfiguriert ist, dass sie die eine Portnummer für SAProuter zulässt."
      ],
      "References": [
        "- BSI APP.4.2 SAP-ERP-System, APP.4.2.A3 Netzwerksicherheit/ Netzsicherheit",
        "- CIS CSC 8, 12, 15",
        "- COBIT 5 DSS05.02, APO13.01",
        "- ISA 62443-3-3:2013 SR 3.1, SR 3.5, SR 3.8, SR 4.1, SR 4.3, SR 5.1, SR 5.2, SR 5.3, SR 7.1, SR 7.6",
        "- ISO/IEC 27001:2013 A.13.1.1, A.13.2.1, A.14.1.3",
        "- NIST SP 800-53 Rev. 4 AC-4, AC-17, AC-18, CP-8, SC-7, SC-19, SC-20, SC-21, SC-22, SC-23, SC-24, SC-25, SC-29, SC-32, SC-36, SC-37, SC- 38, SC-39, SC-40, SC-41, SC-43"
      ]
    },
    {
      "Shortcode": "PT-P-PT-M01-010",
      "Security Function": "PT",
      "CSF Category": "Schutztechnologie",
      "Technology": "SAP Java",
      "Maturity Level": "1",
      "IPAC": [
        "P"
      ],
      "Defender": [
        "Technologie"
      ],
      "Prerequisites": [],
      "Description": "\nDer Schutz vor böswilligem oder unerkanntem Zugriff auf die Anwendungsserver über den Message Server ist entscheidend für die Aufrechterhaltung der Integrität, Verfügbarkeit und Vertraulichkeit der verschiedenen Anfragen zwischen den Anwendungsservern eines SAP-System, dass in Form eines Clusters betrieben wird.\n",
      "Implementation": "\nEin Netzwerkgerät, das als abtrünniger Anwendungsserver fungiert, kann ein hohes Risiko für das Unternehmen darstellen, wenn die Kommunikation mit legitimen Anwendungsservern zugelassen wird..\n\nFür den Message Server müssen Zugriffskontrolllisten (ACLs) konfiguriert werden, um Angriffe auf die Vertrauensstellung zwischen legitimen Anwendungsservern einzudämmen und abzuwehren.\n\n- Profilparameter ms/acl_info ist im Default Profil angelegt und verweist auf eine gültige ACL-Datei.\n- ACL-Datei sollte keinen Eintrag enthalten, der alle Hosts zulässt (d.h. HOST=* ist kritisch)\n- Trennen Sie die Ports auf dem Message-Server für interne (1) und externe Kommunikation (2)\n- Profilparameter rdisp/msserv_internal definiert die zu verwendenden internen Ports\n- Unterbinden der Kommunikation von anderen Netzwerkgeräten zu dem im Profilparameter rdisp/msserv_internal definierten Port\n- Externe Überwachung des Message Servers durch Setzen des Profilparameters ms/monitor=0 unterbinden\n- Externe Verwaltung des Message-Servers durch Setzen des Profilparameters ms/admin_port=0 verbieten\n\n(1) - Interne Kommunikation dient der Kommunikation zwischen verschiedenen Anwendungsdiensten im Unternehmen\n\n(2) - Externe Kommunikation dient der Kommunikation mit den Benutzern/Kunden\n",
      "Verification": [
        "",
        "- Überprüfen Sie die ACLs für den Message Server anhand des Profilparameters ms/acl_info",
        "- Überprüfen Sie, dass HOST=* nicht in der ACL definiert ist.",
        "- Überprüfen Sie, ob die Ports für internen und externen Datenverkehr aufgeteilt sind und ob die Firewall die Kommunikation zum internen Port blockiert.",
        "- Überprüfen Sie, dass der Profilparameter ms/monitor=0 ist.",
        "- Überprüfen Sie, ob der Profilparameter ms/admin_port=0 ist."
      ],
      "References": [
        "- BSI APP.4.2 SAP-ERP-System, APP.4.2.A9 Absicherung und Überwachung des Message-Servers (B) / Protection and monitoring of the Message-Servers (B)",
        "- SAP Security Baseline Template V2.1: 2.2.1.4, 2.2.1.4.1, 2.2.1.4.2"
      ]
    },
    {
      "Shortcode": "PT-P-IP-M01-012",
      "Security Function": "PT",
      "CSF Category": "Prozesse und Verfahren zum Schutz von Informationen",
      "Technology": "Linux",
      "Maturity Level": "1",
      "IPAC": [
        "P"
      ],
      "Defender": [
        "Technologie"
      ],
      "Prerequisites": [],
      "Description": "\nDie Stärkung und Härtung des Betriebssystems, auf dem das SAP-System des Unternehmens läuft, ist entscheidend für die Sicherheit Ihrer SAP-Implementierung und Ihres Netzwerks.\n",
      "Implementation": "\nWenn Ihr Unternehmen andere Anwendungen unter Linux einsetzt, sollte es bereits eine definierte Baseline für den Einsatz von Linux-Maschinen geben. Im Folgenden finden Sie einige Bereiche, die Sie bei der Absicherung von SAP-Systemen unter Linux im Auge behalten sollten.\n\n - Verbieten Sie externe Root-Anmeldungen\n - Entfernen Sie nicht benötigte Dienste und Konten\n - Entfernen Sie alle nicht benötigten Linux-Anwendungen, Funktionen, Rollen und Komponenten\n - Deaktivieren Sie die Verwendung von X-Window-Systemen (SAP-Anwendungen benötigen sie nicht)\n - Verwenden Sie kein Telnet oder FTP für die Dateiübertragung\n - Regelmäßig Updates einspielen\n - Vermeiden Sie die Verwendung von SUID/SGID mit möglicherweise schwachstellenbehafteten Programmen\n - Dateien werden durch die Konfiguration der Standard-Dateimaske mit den entsprechenden Berechtigungen erstellt\n - Überprüfen Sie regelmäßig Signaturen und Schlüssel von heruntergeladenen Anwendungen oder Patches\n\nEs wird empfohlen, die Vorgaben des Unternehmens für die Absicherung von Linux-Rechnern zu befolgen, sofern sie existieren.\n\nWenn Ihr Unternehmen SUSE Linux für das Hosting von SAP-Anwendungen verwendet, sollten Sie die folgenden Punkte beachten:\n\n- Installieren und konfigurieren Sie den SUSE Security Checker (seccheck), um Benachrichtigungen über alle Sicherheitsänderungen zu aktivieren.\n",
      "Verification": [
        "",
        "- Überprüfen Sie, ob unerwünschte Anwendungen, Dienste, Funktionen, Rollen und Komponenten entfernt wurden",
        "- Überprüfen Sie, ob die Dateiberechtigungen richtig konfiguriert sind.",
        "- Überprüfen Sie, ob Telnet und FTP nicht verwendet werden",
        "- Überprüfen Sie, ob regelmäßig Sicherheitsupdates durchgeführt werden"
      ],
      "References": [
        "- BSI APP.4.2 SAP-ERP-System, APP.4.2.A16 Implementierung von Sicherheitsanforderungen für das Betriebssystem Windows (S) / Umsetzung von Sicherheitsanforderungen für das Betriebssystem Windows (S)"
      ]
    },
    {
      "Shortcode": "PT-PA-IP-M01-002",
      "Security Function": "PT",
      "CSF Category": "Prozesse und Verfahren zum Schutz von Informationen",
      "Technology": "SAP Java",
      "Maturity Level": "1",
      "IPAC": [
        "P",
        "A"
      ],
      "Defender": [
        "Prozess",
        "&",
        "Technologie"
      ],
      "Prerequisites": [
        "PT-A-AC-M01-009"
      ],
      "Description": "\n Standard-Benutzer, die auf SAP-Systeme zugreifen dürfen, sollten ordnungsgemäß verwaltet und konfiguriert werden. Auf diese Weise können Unternehmen das Prinzip der geringsten Privilegien befolgen.\n",
      "Implementation": "\nDie Standardpasswörter für die Standard-Benutzer sollten geändert werden und die Passwortrichtlinie des Unternehmens(1) sollte angewendet werden. Dies gilt insbesondere für die bei der Installation definierte Benutzer (Liste gemäß SAP Namensvorschlag):\n- J2EE_ADM_\\<SID\\>\n- J2EE_GST_\\<SID\\> \n- SAPJSF_\\<SID\\>\n- Administrator\n- Guest\n- pcd_service\n- ume_service\n- SAP\\*\n\nStandard-Benutzer, die nicht benötigt werden, sollten gelöscht oder deaktiviert werden.\n\n(1) - Passwortrichtlinien ändern sich von Unternehmen zu Unternehmen, abhängig von verschiedenen Kriterien wie der Kritikalität der Branche, lokalen oder bundesstaatlichen Gesetzen, Sicherheitsstandards, die für die Branche verbindlich sind, usw.\n",
      "Verification": [
        "",
        "- Standard-Passwort für Standard-Benutzer-IDs wird geändert",
        "- Die Kennwortrichtlinie wird in allen SAP-Systemen ordnungsgemäß angewendet.",
        "- Standard-Benutzer werden gelöscht und deaktiviert, wenn sie nicht verwendet werden"
      ],
      "References": [
        "- BSI APP.4.2 SAP-ERP-System, APP.4.2.A4 Absicherung der ausgelieferten SAP-Standardbenutzer-IDs / Absicherung der ausgelieferten SAP-Standardbenutzer-Kennungen",
        "- SAP Security Baseline Template V2.0: 2.3.1"
      ]
    },
    {
      "Shortcode": "PT-P-PT-M01-011",
      "Security Function": "PT",
      "CSF Category": "Schutztechnologie",
      "Technology": "SAP Java",
      "Maturity Level": "1",
      "IPAC": [
        "P"
      ],
      "Defender": [
        "Technologie"
      ],
      "Prerequisites": [],
      "Description": "\nDer Schutz vor böswilligem oder unerkanntem Zugriff auf die Anwendungsserver über den Message Server ist entscheidend für die Aufrechterhaltung der Integrität, Verfügbarkeit und Vertraulichkeit der verschiedenen Anfragen zwischen den Anwendungsservern eines SAP-System, dass in Form eines Clusters betrieben wird.\n",
      "Implementation": "\nEin Netzwerkgerät, das als abtrünniger Anwendungsserver fungiert, kann ein hohes Risiko für das Unternehmen darstellen, wenn die Kommunikation mit legitimen Anwendungsservern zugelassen wird..\n\nFür den Message Server müssen Zugriffskontrolllisten (ACLs) konfiguriert werden, um Angriffe auf die Vertrauensstellung zwischen legitimen Anwendungsservern einzudämmen und abzuwehren.\n\n- Profilparameter ms/acl_info ist im Default Profil angelegt und verweist auf eine gültige ACL-Datei.\n- ACL-Datei sollte keinen Eintrag enthalten, der alle Hosts zulässt (d.h. HOST=* ist kritisch)\n- Trennen Sie die Ports auf dem Message-Server für interne (1) und externe Kommunikation (2)\n- Profilparameter rdisp/msserv_internal definiert die zu verwendenden internen Ports\n- Unterbinden der Kommunikation von anderen Netzwerkgeräten zu dem im Profilparameter rdisp/msserv_internal definierten Port\n- Externe Überwachung des Message Servers durch Setzen des Profilparameters ms/monitor=0 unterbinden\n- Externe Verwaltung des Message-Servers durch Setzen des Profilparameters ms/admin_port=0 verbieten\n\n(1) - Interne Kommunikation dient der Kommunikation zwischen verschiedenen Anwendungsdiensten im Unternehmen\n\n(2) - Externe Kommunikation dient der Kommunikation mit den Benutzern/Kunden\n",
      "Verification": [
        "",
        "- Überprüfen Sie die ACLs für den Message Server anhand des Profilparameters ms/acl_info",
        "- Überprüfen Sie, dass HOST=* nicht in der ACL definiert ist.",
        "- Überprüfen Sie, ob die Ports für internen und externen Datenverkehr aufgeteilt sind und ob die Firewall die Kommunikation zum internen Port blockiert.",
        "- Überprüfen Sie, dass der Profilparameter ms/monitor=0 ist.",
        "- Überprüfen Sie, ob der Profilparameter ms/admin_port=0 ist."
      ],
      "References": [
        "- BSI APP.4.2 SAP-ERP-System, APP.4.2.A9 Absicherung und Überwachung des Message-Servers (B) / Protection and monitoring of the Message-Servers (B)",
        "- SAP Security Baseline Template V2.1: 2.2.1.4, 2.2.1.4.1, 2.2.1.4.2"
      ]
    },
    {
      "Shortcode": "PT-P-IP-M01-013",
      "Security Function": "PT",
      "CSF Category": "Prozesse und Verfahren zum Schutz von Informationen",
      "Technology": "Windows-Betriebssystem",
      "Maturity Level": "1",
      "IPAC": [
        "P"
      ],
      "Defender": [
        "Technologie"
      ],
      "Prerequisites": [],
      "Description": "\nDie Stärkung und Härtung des Betriebssystems, auf dem das SAP-System des Unternehmens läuft, ist entscheidend für die Sicherheit Ihrer SAP-Implementierung und Ihres Netzwerks. Das Windows-Betriebssystem ist berühmt für seine Vielzahl von Sicherheitslücken, die täglich gefunden werden.  \n",
      "Implementation": "\nWenn Ihr Unternehmen eine Windows-Umgebung betreibt, sollte es bereits eine definierte Baseline für die Bereitstellung von Windows-Rechnern geben. Daher sollten Sie bei der Absicherung von SAP-Systemen, die unter Windows laufen, die folgenden Punkte beachten.\n\n - Remote Desktop deaktivieren oder sichern\n - Entfernen Sie nicht benötigte Dienste und Konten\n - Entfernen Sie alle nicht benötigten Windows-Anwendungen, Funktionen, Rollen und Komponenten\n - Lokale Administratorkonten müssen deaktiviert oder gesichert werden\n - Regelmäßig zu installierende Updates\n\nEs wird empfohlen, die Grundregeln des Unternehmens für die Absicherung von Windows-Rechnern zu befolgen, sofern diese vorhanden sind.\n",
      "Verification": [
        "",
        "- Überprüfen Sie, ob unerwünschte Anwendungen, Dienste, Funktionen, Rollen und Komponenten entfernt wurden.",
        "- Überprüfen Sie, ob lokale Administratorkonten deaktiviert oder ordnungsgemäß gesichert sind",
        "- Überprüfen Sie, ob Sicherheitsupdates regelmäßig durchgeführt werden"
      ],
      "References": [
        "- BSI APP.4.2 SAP-ERP-System, APP.4.2.A16 Implementierung von Sicherheitsanforderungen für das Betriebssystem Windows (S) / Umsetzung von Sicherheitsanforderungen für das Betriebssystem Windows (S)"
      ]
    },
    {
      "Shortcode": "PT-P-IP-M01-003",
      "Security Function": "PT",
      "CSF Category": "Prozesse und Verfahren zum Schutz von Informationen",
      "Technology": "SAP ABAP",
      "Maturity Level": "1",
      "IPAC": [
        "P"
      ],
      "Defender": [
        "Prozess",
        "/",
        "Technologie"
      ],
      "Prerequisites": [
        ""
      ],
      "Description": "\nUm potenzielle Bedrohungen in anfälligen SAP-Systemen zu reduzieren und das erforderliche Sicherheitsniveau des Unternehmens aufrechtzuerhalten, müssen Sicherheitsexperten regelmäßig Sicherheits- und Software-Updates durchführen.\n\n",
      "Implementation": "\nSAP-Sicherheitshinweise werden normalerweise jeden zweiten Dienstag im Monat veröffentlicht. Diese Hinweise helfen dabei, entdeckte Schwachstellen in SAP-Systemen zu beseitigen.\n\nOrte, an denen Sie die neuesten SAP-Sicherheitshinweise und Support-Pakete erhalten:\n- SAP Software Update Manager (eine Lizenz ist erforderlich)\n- SAP Patch Management Tool (starten Sie mit der SPAM-Transaktion; dafür ist ein Wartungszertifikat erforderlich)\n- Identifizieren Sie SAP Sicherheitshinweise für das System mit der Transaktion SNOTE\n- SAP Sicherheitshinweise aus dem SAP Support Launchpad\n\nUm die Verfügbarkeit und Integrität von Produktionssystemen aufrechtzuerhalten, ist es notwendig, einen Patch-Management-Prozess [1] zu verfolgen.\n\n[1] - Es wird empfohlen, einen Prozess für die Patch-Verwaltung einzurichten, wenn in Ihrem Unternehmen noch kein Prozess existiert; der Prozess sollte auch auf Nicht-SAP-Lösungen angewendet werden.\n",
      "Verification": [
        "",
        "- Planen Sie einen regelmäßigen Patching-Prozess für SAP-Systeme",
        "- Erstellen/Befolgen eines Patch-Management-Prozesses zur Aufrechterhaltung der Integrität und Verfügbarkeit von SAP-Systemen"
      ],
      "References": [
        "- BSI APP.4.2 SAP-ERP-System, APP.4.2.A1 Sichere Konfiguration des SAP-ABAP-Stacks (B) / Sichere Konfiguration des SAP-ABAP-Stacks (B)",
        "- BSI APP.4.2 SAP-ERP-System, APP.4.2.A10 Regelmäßige Implementierung von Sicherheitskorrekturen [Fachabteilung] (B) / Regelmäßige Implementierung von Sicherheitskorrekturen [Fachabteilung] (B)",
        "- SAP Security Baseline Template V2.0: 2.2.2.1, 2.2.2.1.1, 2.2.2.1.2, 2.2.2.1.2 und 2.2.2.1.3"
      ]
    },
    {
      "Shortcode": "PT-P-PT-M01-001",
      "Security Function": "PT",
      "CSF Category": "Schutztechnologie",
      "Technology": "SAP ABAP",
      "Maturity Level": "1",
      "IPAC": [
        "P"
      ],
      "Defender": [
        "Technologie"
      ],
      "Prerequisites": [],
      "Description": "\nSecurity Audit Logs (SAL) müssen in der gesamten SAP-Umgebung aktiviert und richtig konfiguriert sein. Dies hilft den Sicherheitsteams, potenzielle Bedrohungen zu erkennen, die ihre Umgebung beeinträchtigen könnten.\n",
      "Implementation": "\nEs ist wichtig, dass Sie die Profilparameter für die Sicherheitsauditprotokolle aktivieren und richtig konfigurieren. Die folgenden Parameter helfen Ihnen dabei:\n\n- Verwenden Sie die Transaktion RSAU_CONFIG oder SM19, um die erforderlichen Parameter einzustellen.\n- rsau/enable = 1\n- Geben Sie den Speicherort des Sicherheitsauditprotokolls an, indem Sie rsau/local/file setzen.\n- rsau/integrity = 1\n- rsau/log_peer_address = 1 (Hinweis: der Parameter kann zu Warnungen führen, die aber problemlos ignoriert werden können)\n- rsau/selection_slots ≥ 10 5\n- rsau/user_selection = 1\n- Geben Sie die maximale Länge des Protokolls an, indem Sie den Parameter rsau/max_diskspace_local setzen.\n\nDie folgenden Mindesteinstellungen des Security Audit Logs müssen vorgenommen sein:\n\n- Auditing sollte aktiv sein\n- Aktiver Filter für alle Benutzer für alle kritischen Ereignisse\n- Protkollschutzformat aktiv\n\nEs wird empfohlen, die Protokolle an einen zentralen Protokollserver zu senden, um die Protokolle besser analysieren und filtern zu können. Dies hilft auch dabei, die Größe auf dem eigentlichen System zu erhalten.\n\nMit der Transaktion RSAU_CONFIG können Sie je nach den Anforderungen Ihres Unternehmens weitere Parameter konfigurieren.\n\nHinweis: Referenz DT-P-AE-M01-002 Kontrollen zur Identifizierung von verfügbaren Protokollen, die für Ihre Anforderungen gesammelt werden können\n",
      "Verification": [
        "",
        "- Überprüfen Sie, ob die Sicherheitsauditprotokolle aktiviert sind, indem Sie den Parameter rsau/enable überprüfen.",
        "- Überprüfen Sie, ob die Mindesteinstellungen für Security Audit Logs konfiguriert sind.",
        "- Überprüfen Sie, ob alle Ereignisse für kritische Benutzer, wie SAP*, DDIC, SAPCPIC, Notfall- und Support-Benutzer, für alle Clients gesammelt und geprüft werden.",
        "- Prüfen Sie, ob alle kritischen Ereignisse für alle Clients gesammelt und geprüft werden"
      ],
      "References": [
        "- BSI APP.4.2 SAP-ERP-System, APP.4.2.A21 Configuration of the Security Audit Log (S) / Konfiguration des Security Audit Logs (S)",
        "- SAP Security Baseline Template V2.1: 2.4.3.1.1",
        "- CIS CSC 1, 3, 5, 6, 14, 15, 16",
        "- COBIT 5 APO11.04, BAI03.05, DSS05.04, DSS05.07, MEA02.01",
        "- ISA 62443-2-1:2009 4.3.3.3.9, 4.3.3.5.8, 4.3.4.4.7, 4.4.2.1, 4.4.2.2, 4.4.2.4",
        "- ISA 62443-3-3:2013 SR 2.8, SR 2.9, SR 2.10, SR 2.11, SR 2.12",
        "- ISO/IEC 27001:2013 A.12.4.1, A.12.4.2, A.12.4.3, A.12.4.4, A.12.7.1",
        "- NIST SP 800-53 Rev. 4 AU Familie"
      ]
    },
    {
      "Shortcode": "PT-C-IP-M01-001",
      "Security Function": "PT",
      "CSF Category": "Prozesse und Verfahren zum Schutz von Informationen",
      "Technology": "SAP ABAP",
      "Maturity Level": "1",
      "IPAC": [
        "C"
      ],
      "Defender": [
        "Prozess"
      ],
      "Prerequisites": [],
      "Description": "\nDie Implementierung von kundeneigenem Code im Unternehmen sollte einen definierten Änderungsmanagementprozess haben. Auf diese Weise können Unternehmen festlegen, ob benutzerdefinierte Anwendungen als Ersatz für bestehende Anwendungen verwendet oder aus dem Unternehmen entfernt werden sollen.\n",
      "Implementation": "\nEin standardmäßiger und definierter Änderungsmanagementprozess sollte die unten definierten Kontrollen abdecken, wenn Sie kundenspezifische Anwendungen liefern oder bearbeiten, die in das SAP-Ökosystem des Unternehmens integriert werden oder bereits integriert sind(1).\n\n(1) - Dies kann an das Änderungsmanagement der Organisation angepasst werden, falls vorhanden.\n",
      "Verification": [
        "",
        "- Implementierung von Vorgaben, die die Installation von kundeneigenen Anwendungen klar definieren",
        "- Modifizierung des kundeneigenem Codes ist begrenzt und wird nur bei Bedarf vorgenommen",
        "- Änderungen werden getestet, um Auswirkungen auf den Betrieb zu vermeiden",
        "- Installation und Entfernung kundeneigener Anwendungen werden ordnungsgemäß dokumentiert und nachverfolgt",
        "- Definition eines sicheren Softwareentwicklungszyklus (SSDLC) bei der Anpassung, Änderung, Entwicklung und Integration von Anwendungen"
      ],
      "References": [
        "- BSI APP.4.2 SAP-ERP-System, APP.4.2.A26 Schutz des kundeneigenen Codes im SAP-ERP-System (S) / Schutz des kundeneigenen Codes im SAP-ERP-System (S)",
        "- CIS CSC 3, 11",
        "- COBIT 5 BAI01.06, BAI06.01",
        "- ISA 62443-2-1:2009 4.3.4.3.2, 4.3.4.3.3",
        "- ISA 62443-3-3:2013 SR 7.6",
        "- ISO/IEC 27001:2013 A.12.1.2, A.12.5.1, A.12.6.2, A.14.2.2, A.14.2.3, A.14.2.4",
        "- NIST SP 800-53 Rev. 4 CM-3, CM-4, SA-10"
      ]
    },
    {
      "Shortcode": "PT-P-IP-M01-010",
      "Security Function": "PT",
      "CSF Category": "Prozesse und Verfahren zum Schutz von Informationen",
      "Technology": "SAP Java",
      "Maturity Level": "1",
      "IPAC": [
        "P"
      ],
      "Defender": [
        "Prozess",
        "/",
        "Technologie"
      ],
      "Prerequisites": [
        ""
      ],
      "Description": "\nDie Festlegung einer strengen Kennwortrichtlinie ist unerlässlich, um sich vor unbefugtem Zugriff auf Ihre Systeme durch gestohlene Anmeldedaten oder Hashes zu schützen. Eine schwache Passwortpolitik kann zu verschiedenen Bedrohungen für das Unternehmen führen, die vom Zugang zu sensiblen Informationen bis zur Beschädigung eines ganzen Systems reichen.\n",
      "Implementation": "\nNachfolgend finden Sie Informationen zur Festlegung von Passwortrichtlinien für ABAP-Systeme:\n\n- Setzen Sie die minimale Passwortlänge (1) mit der UME-Eigenschaft ume.logon.security_policy.password_min_length >= 12\n- Erhöhen Sie die maximale Passwortlänge mit der UME-Eigenschaft ume.logon.security_policy.password_max_length (Standard ist nur 14)\n- Legen Sie ein Verfallsdatum für zu ändernde Kennwörter mit der UME-Eigenschaft ume.logon.security_policy.password_expire_days <= 90 fest\n- Definieren Sie eine Größe für den Passwortverlauf mit der UME-Eigenschaft ume.logon.security_policy.password_history >= 5\n- Um die Benutzer zur Einhaltung der Kennwortrichtlinie zu zwingen, setzen Sie die UME-Eigenschaft ume.logon.security_policy.enforce_policy_at_logon = TRUE\n- Setzen Sie die maximalen Anmeldeversuche durch die UME-Eigenschaft ume.logon.security_policy.lock_after_invalid_attempts <= 5\n- Verweigern Sie die Verwendung alter Passwörter in neuen Passwörtern, indem Sie die UME-Eigenschaft ume.logon.security_policy.oldpass_in_newpass_allowed = FALSE setzen\n- Erlauben Sie Benutzern, ihr eigenes Passwort zu ändern ume.logon.security_policy.password_change_allowed = TRUE\n- Definieren Sie eine Liste bekannter Passwörter, die von Benutzern nicht verwendet werden dürfen, durch ume.logon.security_policy.password_impermissible\n- Verhindern Sie die Verwendung von Benutzer-IDs als Teil des Passworts, indem Sie die UME-Eigenschaftume.logon.security_policy.userid_in_password_allowed = FALSE setzen.\n\n\nPasswortkomplexität einstellen:\n- Setzen Sie UME propoerty ume.logon.security_policy.password_alpha_numeric_required >= 1\n- Setzen Sie UME ume.logon.security_policy.password_mix_case_required >= 1\n- Setzen Sie UME ume.logon.security_policy.password_special_char_required >= 1\n\n\n(1) - Die SAP-Basisrichtlinie empfiehlt eine Mindestlänge von 8 Zeichen. Unsere Empfehlung und Untersuchungen zum Knacken von Passwörtern zeigen, dass eine Mindestlänge von 8 Zeichen mit den heutigen Computern leicht geknackt werden kann.\n",
      "Verification": [
        "",
        "- Überprüfen Sie, ob eine Kennwortrichtlinie mit den im Abschnitt Implementierung empfohlenen Werten vorhanden ist."
      ],
      "References": [
        "- BSI APP.4.2 SAP-ERP-System, APP.4.2.A13 SAP-Passwortsicherheit (S) / SAP-Passwortsicherheit (S)",
        "- SAP Security Baseline Template V2.1: 2.3.2.2, 2.3.2.2.2"
      ]
    },
    {
      "Shortcode": "PT-A-AC-M01-009",
      "Security Function": "PT",
      "CSF Category": "Benutzerverwaltung, Authentifizierung und Zugriffskontrolle",
      "Technology": "SAP ABAP",
      "Maturity Level": "1",
      "IPAC": [
        "A"
      ],
      "Defender": [
        "Technologie"
      ],
      "Prerequisites": [],
      "Description": "\nSAP-Standardbenutzer müssen verwaltet und sicher konfiguriert werden, um jeglichen Missbrauch von SAP-Systemen zu verhindern. Dazu gehört das Ändern von Standardpasswörtern und die Einschränkung von Standardbenutzern.\n",
      "Implementation": "\nDie folgenden Standardbenutzer, die in ABAP-Systemen zu finden sind, müssen verwaltet und sicher konfiguriert werden: (Der Abschnitt Überprüfung der Maßnahme hilft Unternehmen dabei, die grundlegenden Anforderungen zur Sicherung dieser Benutzer zu erfüllen)\n1. SAP*\n2. DDIC\n3. SAPCPIC\n4. TMSADM\n5. EARLYWATCH\n6. Vom SAP Solution Manager angelegte Benutzer\n\n",
      "Verification": [
        "",
        "- SAP*",
        "  - Muss in allen Mandanten vorhanden sein",
        "  - Muss in allen Mandanten gesperrt sein",
        "  - Standard-Passwort muss geändert werden",
        "  - Muss in allen Mandanten der Gruppe SUPER angehören",
        "  - Es darf kein Profil zugewiesen werden (insbesondere SAP_ALL)",
        "  - der Profilparameter login/no_automatic_user_sapstar muss auf 1 gesetzt sein",
        "",
        "",
        "- DDIC",
        "  - Standard-Passwort muss geändert werden",
        "  - Muss in allen Clients zur Gruppe SUPER gehören",
        "",
        "- SAPCPIC",
        "  - Löschen, wenn der Benutzer nicht benötigt wird",
        "  - Falls erforderlich, muss das Standardkennwort geändert werden",
        "  - Muss in allen Mandanten der Gruppe SUPER angehören",
        "",
        "- TMSADM",
        "  - Standard-Passwort muss geändert werden",
        "  - Sollte nur in Mandant 000 existieren",
        "  - Muss der Gruppe SUPER in Mandant 000 angehören",
        "  - Berechtigungsprofil S_A.TMSADM darf nur vergeben werden",
        "",
        "- EARLYWATCH",
        "  - Der Benutzer sollte in keinem Client existieren",
        "",
        "- Andere vom SAP Solution Manager angelegte Benutzer (SOLMAN_BTC, CONTENTSERV, SMD_BI_RFC, SMD_RFC, SMDAGENT_SAPSolutionManagerSID, SMD_ADMIN, SMD_AGT, SAPSUPPORT, SOLMAN_ADMIN)",
        "  - Standard-Passwort muss geändert werden"
      ],
      "References": [
        "- BSI APP.4.2 SAP-ERP-System, APP.4.2.A4 Konfiguration und Absicherung der SAP-Benutzerverwaltung / Konfiguration und Absicherung der SAP-Benutzerverwaltung",
        "- SAP Security Baseline Template V2.1: 2.3.1"
      ]
    },
    {
      "Shortcode": "PT-P-IP-M01-014",
      "Security Function": "PT",
      "CSF Category": "Prozesse und Verfahren zum Schutz von Informationen",
      "Technology": "SAP HANA",
      "Maturity Level": "1",
      "IPAC": [
        "P"
      ],
      "Defender": [
        "Prozess"
      ],
      "Prerequisites": [
        ""
      ],
      "Description": "\nDie SAP-Datenbank enthält wichtige Informationen und Daten für verschiedene Abteilungen innerhalb eines Unternehmens. Die Daten müssen immer gesichert, durch Verschlüsselung geschützt, regelmäßig gewartet und überprüft und regelmäßig getestet werden.   \n",
      "Implementation": "\nBackups des Datenbanksystems und Backups der Mandanten müssen regelmäßig und konsistent durchgeführt werden. Eine vollständige Datenbanksicherung sollte wöchentlich durchgeführt werden, eine differenzielle oder inkrementelle Sicherung im Laufe der Woche.\n",
      "Verification": [
        "",
        "- Eine wöchentlich geplante vollständige Datenbanksicherung",
        "- Differenzielle oder inkrementelle Backups, die täglich unter der Woche eingeplant werden"
      ],
      "References": [
        "- CIS CSC 10",
        "- COBIT 5 APO13.01, DSS01.01, DSS04.07",
        "- ISA 62443-2-1:2009 4.3.4.3.9",
        "- ISA 62443-3-3:2013 SR 7.3, SR 7.4",
        "- ISO/IEC 27001:2013 A.12.3.1, A.17.1.2, A.17.1.3, A.18.1.3",
        "- NIST SP 800-53 Rev. 4 CP-4, CP-6, CP-9"
      ]
    },
    {
      "Shortcode": "PT-P-IP-M01-004",
      "Security Function": "PT",
      "CSF Category": "Prozesse und Verfahren zum Schutz von Informationen",
      "Technology": "SAP ABAP",
      "Maturity Level": "1",
      "IPAC": [
        "P"
      ],
      "Defender": [
        "Prozess",
        "/",
        "Technologie"
      ],
      "Prerequisites": [
        ""
      ],
      "Description": "\nDas Unternehmen ist dafür verantwortlich, die definierten Sicherheitsrichtlinien bei der Installation eines SAP ERP-Systems ordnungsgemäß zu dokumentieren und einzuhalten.\n",
      "Implementation": "\nSicherheitskonzepte für verschiedene SAP-Funktionseinheiten, Technologien oder bestimmte Bereiche wie z.B. Berechtigungen müssen mit den allgemeinen SAP-Sicherheitsvorgaben abgeglichen werden.\n\nEs ist wichtig, alle sicherheitsrelevanten Maßnahemen zu dokumentieren, die bei der Installation oder im aktuellen Betrieb durchgeführt wurden.\n\nDas für den Betrieb von SAP Systemen gewählte Betriebssystem sollte entsprechend den Sicherheitsrichtlinien des Unternehmens gehärtet und angemessen gesichert sein.\n",
      "Verification": [
        "",
        "- Überprüfen Sie die Dokumentation der Sicherheitsrichtlinien für installierte SAP-Systeme"
      ],
      "References": [
        "- BSI APP.4.2 SAP-ERP-System, APP.4.2.A11 Sichere Installation eines SAP-ERP-Systems (S) / Secure Installation of a SAP-ERP-Systems (S)"
      ]
    },
    {
      "Shortcode": "PT-P-PT-M01-007",
      "Security Function": "PT",
      "CSF Category": "Schutztechnologie",
      "Technology": "SAP Java",
      "Maturity Level": "1",
      "IPAC": [
        "P"
      ],
      "Defender": [
        "Technologie"
      ],
      "Prerequisites": [
        ""
      ],
      "Description": "\nSecurity Audit Logs (SAL) müssen in der gesamten SAP-Umgebung aktiviert und richtig konfiguriert sein. Dies hilft den Sicherheitsteams, potenzielle Bedrohungen zu erkennen, die ihre Umgebung beeinträchtigen könnten.\n",
      "Implementation": "\nEs ist wichtig, dass Sie die UME-Eigenschaften in Bezug auf Sicherheitsauditprotokolle aktivieren und richtig konfigurieren. Die folgenden Parameter helfen Ihnen dabei:\n\n- ume.secaudit.get_object_name = TRUE\n- ume.secaudit.log_actor = TRUE\n- ume.logon.security_policy.log_client_hostaddress = TRUE\n- ume.logon.security_policy.log_client_hostname = FALSE (erfordert DNS-Lookup, was die Systemleistung beeinträchtigt)\n- enable.xml.hardener = TRUE\n\nEs wird empfohlen, das Loglevel der protokollierten Informationen entsprechendem dem Schutzbedarf der Anwendung anzupassen. Der minimale Schweregrad sollte auf *\"Info\"* gesetzt werden..\n",
      "Verification": [
        "",
        "- Überprüfen Sie, ob die UME-Eigenschaften der Sicherheitsauditprotokolle konfiguriert sind.",
        "- Überprüfen Sie, was protokolliert wird, indem Sie sich beim Netweaver Administrator anmelden und dann zu -> Fehlerbehebung -> Protokolle und Traces -> Protokollkonfiguration navigieren und im Feld Anzeigen die Option 'Protokollierungskategorien' wählen.",
        "- Überprüfen Sie die Logleveleinstellungen auf den zu protokollierenden Schweregrad."
      ],
      "References": [
        "- BSI APP.4.2 SAP-ERP-System, APP.4.2.A21 Configuration of the Security Audit Log (S) / Konfiguration des Security Audit Logs (S)",
        "- SAP Security Baseline Template V2.1: 2.4.3.1.2",
        "- CIS CSC 1, 3, 5, 6, 14, 15, 16",
        "- COBIT 5 APO11.04, BAI03.05, DSS05.04, DSS05.07, MEA02.01",
        "- ISA 62443-2-1:2009 4.3.3.3.9, 4.3.3.5.8, 4.3.4.4.7, 4.4.2.1, 4.4.2.2, 4.4.2.4",
        "- ISA 62443-3-3:2013 SR 2.8, SR 2.9, SR 2.10, SR 2.11, SR 2.12",
        "- ISO/IEC 27001:2013 A.12.4.1, A.12.4.2, A.12.4.3, A.12.4.4, A.12.7.1",
        "- NIST SP 800-53 Rev. 4 AU Familie"
      ]
    },
    {
      "Shortcode": "PT-P-IP-M01-005",
      "Security Function": "PT",
      "CSF Category": "Prozesse und Verfahren zum Schutz von Informationen",
      "Technology": "SAP ABAP",
      "Maturity Level": "1",
      "IPAC": [
        "P"
      ],
      "Defender": [
        "Prozess",
        "/",
        "Technologie"
      ],
      "Prerequisites": [
        ""
      ],
      "Description": "\nDie Festlegung einer strengen Kennwortrichtlinie ist unerlässlich, um sich vor unbefugtem Zugriff auf Ihre Systeme durch gestohlene Anmeldedaten oder Hashes zu schützen. Eine schwache Passwortpolitik kann zu verschiedenen Bedrohungen für das Unternehmen führen, die vom Zugang zu sensiblen Informationen bis zur Beschädigung eines ganzen Systems reichen.\n",
      "Implementation": "\nNachfolgend finden Sie Informationen zur Festlegung von Passwortrichtlinien für ABAP-Systeme:\n\n- Legen Sie die Mindestlänge des Passworts (1) mit dem Profilparameter login/min_password_lng >= 12 fest.\n- Legen Sie mit dem Profilparameter login/password_max_idle_initial eine maximale Anzahl von Tagen fest, die ein Kennwort unbenutzt bleiben kann (zwischen 1 und 14)\n- Legen Sie mit dem Profilparameter login/password_expiration_time <= 90 ein Ablaufdatum für zu ändernde Kennwörter fest.\n- Legen Sie eine Größe für den Passwortverlauf mit dem Profilparameter login/password_history_size >= 5 fest\n- Speichern Sie keine zu interpretierenden Passwörter für alte Kernel, indem Sie den Profilparameter login/password_downwards_compatibility=0 setzen\n- Um Benutzer zur Einhaltung der Kennwortrichtlinie zu zwingen, setzen Sie den Profilparameter login/password_compliance_to_current_policy=1\n- Entfernen Sie alte abwärtskompatible Passwort-Hashes in den Feldern BCODE und PASSCODE aus der Tabelle USR02\n- Maximale Anmeldeversuche durch Profilparameter login/fails_to_user_lock <= 5 festlegen\n- Deaktivieren der automatischen Entsperrung durch den Profilparameter login/failed_user_auto_unlock = 0\n- Festlegen eines maximalen Zeitraums, in dem ein unbenutztes produktives Kennwort gültig bleibt durch den Profilparameter login/max_idle_productive <= 90\n- Anmeldung mit ursprünglichen oder abgelaufenen Benutzerkonten verweigern durch Setzen des Profilparameters icf/reject_expired_passwd = 1\n- Anmeldung mit anfänglichen oder abgelaufenen Benutzerkonten über RFC verweigern, indem Sie den Profilparameter rfc/reject_expired_passwd = 1 setzen.\n- Deaktivieren Sie die Passwortanmeldung, wenn die Organisation andere Authentifizierungsmethoden verwendet, indem Sie den Profilparameter login/disable_password_logon > 0 setzen.\n- Bei der Verwendung der Authentifizierungsmethode Single Sign-on (SSO) muss mit dem Profilparameter login/password_change_for_SSO geprüft werden, ob die Passwörter eines Benutzers geändert werden müssen.\n- Legen Sie mit dem Profilparameter login/password_change_waittime > 0 eine Zeitspanne (gemessen in Tagen) fest, in der ein Benutzer sein Passwort erneut ändern kann.\n- Legen Sie den Hash-Algorithmus und die Kodierung für das neue Passwort mit dem Profilparameter login/password_hash_algorithm = encoding=RFC2307, algorithm=iSSHA-512, iterations=15000, saltsize=256 fest (Der Profilparameter login/password_downwards_compatibility sollte nicht gleich 5 sein, sonst macht der Profilparameter für den Hash-Algorithmus keinen Sinn)\n\nPasswortkomplexität einstellen:\n- Setzen Sie den Profilparameter login/min_password_digits >= 1\n- Setzen Sie den Profilparameter login/min_password_letters >= 1\n- Setzen Sie den Profilparameter login/min_password_lowercase >= 1\n- Setzen Sie den Profilparameter login/min_password_uppercase >= 1\n- Setzen Sie den Profilparameter login/min_password_specials >= 1\n- Profilparameter login/min_password_diff >= 3 setzen\n\n\n(1) - Die SAP-Basisrichtlinie empfiehlt eine Mindestlänge von 8 Zeichen. Unsere Empfehlung und Untersuchungen zum Knacken von Passwörtern zeigen, dass eine Mindestlänge von 8 Zeichen mit den heutigen Geräten leicht zu knacken ist.\n",
      "Verification": [
        "",
        "- Überprüfen Sie, ob eine Kennwortrichtlinie mit den im Abschnitt Implementierung empfohlenen Werten vorhanden ist.",
        "- Überprüfen Sie, ob die Tabelle USR02 alte abwärtskompatible Passwort-Hashes in den Feldern BCODE und PASSCODE enthält.",
        ""
      ],
      "References": [
        "- BSI APP.4.2 SAP-ERP-System, APP.4.2.A13 SAP-Passwortsicherheit (S) / SAP-Passwortsicherheit (S)",
        "- SAP Security Baseline Template V2.1: 2.3.2.2, 2.3.2.2.1",
        "- SAP-Hinweis 1458262"
      ]
    },
    {
      "Shortcode": "PT-PA-IP-M01-001",
      "Security Function": "PT",
      "CSF Category": "Prozesse und Verfahren zum Schutz von Informationen",
      "Technology": "SAP ABAP",
      "Maturity Level": "1",
      "IPAC": [
        "P",
        "A"
      ],
      "Defender": [
        "Prozess",
        "&",
        "Technologie"
      ],
      "Prerequisites": [
        "PT-A-AC-M01-009"
      ],
      "Description": "\n Standard-Benutzer, die auf SAP-Systeme zugreifen dürfen, sollten ordnungsgemäß verwaltet und konfiguriert werden. Auf diese Weise können Unternehmen das Prinzip der geringsten Privilegien befolgen.\n",
      "Implementation": "\nDie Standardpasswörter für die Standard-Benutzer sollten geändert werden und die Passwortrichtlinie des Unternehmens(1) sollte angewendet werden.\n\nStandard-Benutzer, die nicht benötigt werden, sollten gelöscht oder deaktiviert werden.\n\nObsolete standard-Benutzer wie EARLYWATCH sollten in keinem Client existieren.\n\n(1) - Passwortrichtlinien ändern sich von Unternehmen zu Unternehmen, abhängig von verschiedenen Kriterien wie der Kritikalität der Branche, lokalen oder bundesstaatlichen Gesetzen, Sicherheitsstandards, die für die Branche verbindlich sind, usw.\n",
      "Verification": [
        "",
        "- Standard-Passwort für Standard-Benutzer-IDs wird geändert",
        "- Die Kennwortrichtlinie wird in allen SAP-Systemen ordnungsgemäß angewendet.",
        "- Standard-Benutzer werden gelöscht und deaktiviert, wenn sie nicht verwendet werden"
      ],
      "References": [
        "- BSI APP.4.2 SAP-ERP-System, APP.4.2.A4 Absicherung der ausgelieferten SAP-Standardbenutzer-IDs / Absicherung der ausgelieferten SAP-Standardbenutzer-Kennungen",
        "- SAP Security Baseline Template V2.0: 2.3.1"
      ]
    },
    {
      "Shortcode": "PT-P-IP-M01-001",
      "Security Function": "PT",
      "CSF Category": "Identitätsmanagement, Authentifizierung und Zugriffskontrolle",
      "Technology": "SAP ABAP",
      "Maturity Level": "1",
      "IPAC": [
        "A"
      ],
      "Defender": [
        "Technologie"
      ],
      "Prerequisites": [],
      "Description": "\nDer Zugriff auf SAP-Datenbanken muss vor unberechtigtem Zugriff und Missbrauch geschützt werden.  \n",
      "Implementation": "\nSAP Benutzer dürfen grundsätzliche keinen Zugriff auf die SAP-Systemdatenbank erhalten. Sonstige Benutzern müssen spezifische Datenbankberechtigungen gemäß des Minimalitätsprinzips und der Aufgabentrennung erhalten.\n\nÜberprüfen Sie die Transaktionsprotokolldatei auf nicht benötigte Datenbankbenutzer. Die Transaktionsdatei können Sie durch Ausführen von R3trans -d einsehen.\n\nBenutzer, die auf die Datenbank zugreifen dürfen, sind nur auf die für Ihre Aufgabe notwendigen Tabellen zu beschränken\n",
      "Verification": [
        "",
        "- SAPR3, SAPSID oder SAPABAP1 für den Zugriff auf die Datenbank deaktiviert.",
        "- Benutzer, die nicht für den Zugriff auf die Datenbank benötigt werden, werden entfernt.",
        "- Datenmanipulation sind nur dem SAP-Support gestattet",
        "- Benutzer, die auf die Datenbank zugreifen müssen, erhalten keine Berechtigungen für die Tabelle USR\\*, die Tabelle T000, SAPUSER, RFCDES, PA\\*, HCL\\* und alle anderen Tabellen, die für ihre Arbeit nicht erforderlich sind"
      ],
      "References": [
        "- BSI APP.4.2 SAP-ERP-System, APP.4.2.A7 Absicherung der SAP-Datenbank/ Absicherung der SAP-Datenbanken"
      ]
    },
    {
      "Shortcode": "IY-C-RA-M01-001",
      "Security Function": "IY",
      "CSF Category": "Risikobewertung",
      "Technology": "ABAP",
      "Maturity Level": "1",
      "IPAC": [
        "C"
      ],
      "Defender": [
        "Prozess"
      ],
      "Prerequisites": [
        ""
      ],
      "Description": "\nZugang & Autorisierung\n\nABAP verwendet ein meist explizites Berechtigungsmodell. Das bedeutet, dass eine Berechtigungsprüfung nur dann stattfindet, wenn ein Programm die Prüfung explizit selbst durchführt. Mit anderen Worten: Wenn es keine explizite Berechtigungsprüfung im Code gibt, wird auch nicht geprüft, ob ein Benutzer tatsächlich berechtigt ist.\nIn individuell entwickeltem Code werden Berechtigungsprüfungen häufig übersehen. Das bedeutet, dass das Berechtigungskonzept keine Wirkung hat. Dies führt zu Compliance-Verstößen, die im Falle eines Audits schwerwiegende Folgen haben können. Aus diesem Grund ist es von entscheidender Bedeutung, dass bei Eigenentwicklungen Berechtigungsprüfungen von den Programmen selbst durchgeführt werden, wo immer dies erforderlich ist, und dass alle Berechtigungsprüfungen auch aus formaler Sicht korrekt programmiert sind.\nNeben dem Fehlen von Berechtigungsprüfungen kann auch die Strukturierung von Programmkomponenten die Tragfähigkeit des Berechtigungskonzepts beeinflussen. So sollten Sie z.B. hinterfragen, wie ausführbare Module zusammengesetzt sind, unter der Annahme, dass Schnittstellenberechtigungen nicht granular für die exponierte Geschäftsfunktionalität vergeben werden oder vergeben werden können.\nBerechtigungsprüfungen sind in der Regel der häufigste Sicherheitsfehler in ABAP-Anwendungsentwicklungen.\n",
      "Implementation": "\n1. Die Spezifikation der Änderung enthält eine präzise Beschreibung der Anpassungen der Berechtigungsanforderungen entsprechend der Änderung.\n2. Als Teil des Code Change Review-Prozesses muss der gesamte benutzerdefinierte Code daraufhin überprüft werden:\n  - Alle Berechtigungsprüfungen verwenden SAP-Standardmechanismen. Dies bedeutet in der Regel, dass entweder:\n    - der Befehl AUTHORITY-CHECK OBJECT oder\n    - ein Modul, das speziell für die Prüfung einer bestimmten Berechtigung entwickelt wurde (wie der SAP-Funktionsbaustein 'AUTHORITY_CHECK_DATASET'),\n    - oder eine Zugriffsdeklaration durch die Data Access Control (DAC)-Sprache für Core Data Services (CDS) muss verwendet werden.\n  - Alle direkt ausführbaren Module implementieren explizite Zugriffsbeschränkungen beim Ausführungsstart, indem sie die Benutzerberechtigungen zum Starten des Moduls überprüfen\n  - Bevor der Befehl CALL TRANSACTION ausgeführt wird, sollte eine Berechtigungsprüfung stattfinden, um sicherzustellen, dass der aktuelle Benutzer tatsächlich berechtigt ist, die Transaktion zu starten. Wird eine Transaktion mit dem Ziel aufgerufen, nur einen eingeschränkten Zugriff auf die Funktionalität der Transaktion zu ermöglichen, z.B. mit vordefinierten Auswahlwerten und dem Zusatz SKIP FIRST SCREEN, kann es sinnvoll sein, keine Berechtigungsprüfung für die Benutzerrechte zum Starten der Transaktion durchzuführen, da dies dem Benutzer unnötig hohe Privilegien abverlangen kann.\n  - Die Implementierung prüft die Berechtigung des Benutzers so nah wie möglich an der Ausführung der geschützten Geschäftsfunktion.\n  - Die Implementierung verarbeitet das Ergebnis der Überprüfung der Benutzerberechtigungen, um den rechtmäßigen Zugriff und die Ausführung zu erlauben und andere durch die Überprüfung von Rückgabecodes wie sy-subrc und Ausnahmen entsprechend der Implementierung der Prüfungen zu verbieten.\n",
      "Verification": [
        "",
        "- Prüfen Sie, ob negative und positive Zugriffskontrolltests spezifiziert sind und die Durchführung im Testprotokoll der Änderung dokumentiert ist.",
        "- Prüfen Sie, ob die Überprüfung des Quellcodes für alle benutzerdefinierten Codeänderungen durchgeführt und dokumentiert wird, um die korrekte Implementierung der Benutzerzugriffskontrolle in der Änderung zu gewährleisten.",
        ""
      ],
      "References": [
        "",
        "- CIS CSC 4",
        "- COBIT 5 APO12.05, APO13.02",
        "- ISO/IEC 27001:2013 Klausel 6.1.3",
        "- NIST SP 800-53 Rev. 4 PM-4, PM-9",
        "- BSI APP (Februar 2020) 4.6 A1, A2, A3, A6, A7",
        "- OWASP ASVS 2.0 V4.1.3, V4.1.4, V4.1.5"
      ]
    },
    {
      "Shortcode": "DT-P-AE-M01-005",
      "Security Function": "DT",
      "CSF Category": "Anomalien und Ereignisse",
      "Technology": "SAP ERP",
      "Maturity Level": "1",
      "IPAC": [
        "P"
      ],
      "Defender": [
        "Prozess"
      ],
      "Prerequisites": [],
      "Description": "\nWorkload Monitor:\n\nDer Workload-Monitor hilft bei der Analyse von Systemstatistiken in SAP-Systemen. Ein wichtiger Bestandteil des Workload-Monitors ist seine Fähigkeit, die von Benutzern durchgeführten Aktivitäten auf dem System zu sammeln. Dies verhindert eine Abstreitbarkeit und hilft bei der Analyse von Änderungen oder Sicherheitsereignissen, die einen Vorfall verursacht haben.\n",
      "Implementation": "\nDer Workload Monitor ist standardmäßig deaktiviert und muss aktiviert werden, wenn Sie von Benutzern verursachte Ereignisse oder Vorfälle untersuchen.\n\nDie Verfolgung von Benutzeraktivitäten ist in verschiedenen Teilen der Welt möglicherweise nicht erlaubt. Achten Sie bei der Verfolgung von Nutzeraktivitäten auf die Einhaltung der Datenschutzbestimmungen, unter die Ihr Unternehmen fällt.\n",
      "Verification": [
        "",
        "- Starten Sie den Systemlastmonitor mit der Transaktion STO3N"
      ],
      "References": []
    },
    {
      "Shortcode": "PT-A-AC-M01-013",
      "Security Function": "PT",
      "CSF Category": "Benutzerverwaltung, Authentifizierung und Zugriffskontrolle",
      "Technology": "SAP ABAP",
      "Maturity Level": "1",
      "IPAC": [
        "A"
      ],
      "Defender": [
        "Prozess"
      ],
      "Prerequisites": [
        ""
      ],
      "Description": "\nSpezifische Vorgaben in Bezug auf Autorisierungsbeschränkungen und Passwörter sollten regelmäßig veröffentlicht, überprüft, kontrolliert und gegebenenfalls überarbeitet werden.\n",
      "Implementation": "\nEs ist wichtig, spezifische Vorgaben zu erstellen, die die verschiedenen Berechtigungs- und Passwortrichtlinien der Organisation berücksichtigen.\n\n- Erstellen Sie eine Vorgaben zur Zugriffskontrolle, um Benutzer und ihre jeweiligen Benutzergruppen zu definieren.\n- Erstellen Sie eine Vorgaben für sichere SAP-Passwörter für alle Benutzer.\n- Erstellen Sie Vorgaben für die Festlegung eines sicheren Passworts, die die Benutzer befolgen können.\n\nHinweis: Die Kontrollen PT-P-IP-M01-005 und PT-P-IP-M01-010 können beim Aufbau einer starken SAP-Passwortvorgabe helfen.\n",
      "Verification": [
        "",
        "- Überprüfen Sie, ob die Berechtigungen und der Zugriff auf SAP-Systeme dokumentiert sind.",
        "- Überprüfen Sie, ob die Benutzer ihren jeweiligen Benutzergruppen entsprechend ihrer Arbeitsrolle zugeordnet sind.",
        "- Überprüfen Sie, ob eine strenge Kennwortvorgabe vorhanden ist und befolgt wird."
      ],
      "References": [
        "- BSI APP.4.2 SAP-ERP-System, APP.4.2.A19 Definition der Sicherheitsrichtlinien für Benutzer / Definition der Sicherheitsrichtlinien für Benutzer",
        "- CIS CSC 3, 5, 12, 14, 15, 16, 18",
        "- COBIT 5 DSS05.04",
        "- ISA 62443-2-1:2009 4.3.3.7.3",
        "- ISA 62443-3-3:2013 SR 2.1",
        "- ISO/IEC 27001:2013 A.6.1.2, A.9.1.2, A.9.2.3, A.9.4.1, A.9.4.4, A.9.4.5",
        "- NIST SP 800-53 Rev. 4 AC-1, AC-2, AC-3, AC-5, AC-6, AC-14, AC-16, AC-24"
      ]
    },
    {
      "Shortcode": "PT-P-PT-M01-008",
      "Security Function": "PT",
      "CSF Category": "Schutztechnologie",
      "Technology": "SAP HANA",
      "Maturity Level": "1",
      "IPAC": [
        "P"
      ],
      "Defender": [
        "Technologie"
      ],
      "Prerequisites": [],
      "Description": "\nSecurity Audit Logs (SAL) müssen in der gesamten SAP-Umgebung aktiviert und richtig konfiguriert sein. Dies hilft den Sicherheitsteams, potenzielle Bedrohungen, die ihre Umgebung beeinträchtigen könnten, zu identifizieren und zu erkennen.\n",
      "Implementation": "\nEs ist wichtig, dass Sie den Audit Trail für HANA in der SAP HANA Administration Console aktivieren und richtig konfigurieren. Die folgenden Parameter helfen Ihnen dabei:\n\n- global_auditing_state = true in der Datei global.ini, Abschnitt Überwachungskonfiguration\n- Die Audit-Richtlinien sollten entsprechend den Sicherheitsanforderungen des Unternehmens konfiguriert werden.\n- Setzen Sie default_audit_trail_type = SYSLOGPROTOCOL oder CSTABLE in der Datei global.ini, Abschnitt auditing configuration. Weitere Informationen zum Audit Trail Layout finden Sie [hier](https://help.sap.com/docs/SAP_HANA_PLATFORM/b3ee5778bc2e4a089d3299b82ec762a7/0a57444d217649bf94a19c0b68b470cc.html)\n\nHinweis: Kritische Benutzer müssen überwacht werden\n",
      "Verification": [
        "",
        "- Überprüfen Sie, ob die Sicherheitsauditprotokolle aktiviert sind, indem Sie den Parameter global_auditing_state = true in der Datei global.ini, Abschnitt auditing configuration, überprüfen.",
        "- Überprüfen Sie, ob alle Ereignisse für kritische Benutzer gesammelt und geprüft werden.",
        "- Überprüfen Sie, dass die CSV-Datei nicht für die Protokollierung sicherheitskritischer Informationen verwendet wird."
      ],
      "References": [
        "- BSI APP.4.2 SAP-ERP-System, APP.4.2.A21 Configuration of the Security Audit Log (S) / Konfiguration des Security Audit Logs (S)",
        "- SAP Security Baseline Template V2.1: 2.4.3.1.3",
        "- CIS CSC 1, 3, 5, 6, 14, 15, 16",
        "- COBIT 5 APO11.04, BAI03.05, DSS05.04, DSS05.07, MEA02.01",
        "- ISA 62443-2-1:2009 4.3.3.3.9, 4.3.3.5.8, 4.3.4.4.7, 4.4.2.1, 4.4.2.2, 4.4.2.4",
        "- ISA 62443-3-3:2013 SR 2.8, SR 2.9, SR 2.10, SR 2.11, SR 2.12",
        "- ISO/IEC 27001:2013 A.12.4.1, A.12.4.2, A.12.4.3, A.12.4.4, A.12.7.1",
        "- NIST SP 800-53 Rev. 4 AU Familie"
      ]
    },
    {
      "Shortcode": "IY-C-RA-M01-005",
      "Security Function": "IY",
      "CSF Category": "Risikobewertung",
      "Technology": "ABAP",
      "Maturity Level": "1",
      "IPAC": [
        "C"
      ],
      "Defender": [
        "Prozess"
      ],
      "Prerequisites": [],
      "Description": "\nEinsatz von Schutzmechanismen\n\nDas SAP-Standardsystem bietet Unternehmen verschiedene Mechanismen zum Schutz ihrer Daten. Aus diesem Grund basieren die Sicherheitsstrategien vieler Unternehmen auf dem Wissen, dass die Mechanismen in den SAP-Standardsystemen eine solide Grundlage bieten und nicht gefährdet sind (oder sein sollten).\nZu diesen Mechanismen gehören:\n- Trennung von Client und Mandant\n- Benutzerverwaltung\n- Rollen- und Berechtigungsverwaltung\n- Trennung von Entwicklung, Test und Produktion\n- Protokollierung von Sicherheitsereignissen\n",
      "Implementation": "\n1. Im Rahmen des Code Change Review-Prozesses muss der gesamte benutzerdefinierte Code daraufhin überprüft werden, dass:\n    - er darf die Sicherheitsmechanismen des SAP-Standardsystems nicht untergraben.\n    - Wenn das SAP-Standardsystem einen Sicherheitsmechanismus für bestimmte Aufgaben vorgesehen hat, dann sollte dieser Sicherheitsmechanismus auch im Custom Code der Änderung verwendet werden.\n    - In der Zielsystemversion, in der die Anwendung ausgeführt werden soll, sollte der ABAP-Code keine veralteten Sprachelemente verwenden.\n    - Die Codierung sollte mit der erweiterten Syntaxprüfung getestet und etwaige Defizite beseitigt werden.\n    - Generell sollten kundeneigene Datenbanktabellen ausgeliefert werden, um eine manuelle Datenpflege durch SAP-Standardwerkzeuge auszuschließen. Wenn eine manuelle Tabellenpflege erforderlich ist, sollte eine Pflegeanwendung (Pflegeview) erstellt werden.\n",
      "Verification": [
        "",
        "- Prüfen Sie, ob die Überprüfung des Quellcodes bei allen benutzerdefinierten Codeänderungen durchgeführt und dokumentiert wird, um die korrekte Verwendung von Schutzmechanismen zu überprüfen."
      ],
      "References": [
        "",
        "- CIS CSC 4",
        "- COBIT 5 APO12.01, APO12.02, APO12.03, APO12.04",
        "- ISA 62443-2-1:2009 4.2.3, 4.2.3.9, 4.2.3.12",
        "- ISO/IEC 27001:2013 Klausel 6.1.2",
        "- NIST SP 800-53 Rev. 4 RA-3, SI-5, PM-12, PM-16"
      ]
    },
    {
      "Shortcode": "DT-P-AE-M01-001",
      "Security Function": "DT",
      "CSF Category": "Anomalien und Ereignisse",
      "Technology": "SAP ERP",
      "Maturity Level": "1",
      "IPAC": [
        "P"
      ],
      "Defender": [
        "Prozess"
      ],
      "Prerequisites": [
        ""
      ],
      "Description": "\nDie Organisation ist verantwortlich für die Festlegung von Richtlinien und Verfahren zur Identifizierung, Erfassung, Beschaffung und Aufbewahrung von Daten, die als Beweismittel verwendet werden.\n",
      "Implementation": "\nBereiche, in denen Sie wichtige Protokolle innerhalb des SAP ERP des Unternehmens erwerben können:\n\n1. Sicherheitsauditprotokoll - DT-P-AE-M01-002\n2. Systemprotokoll - DT-P-AE-M01-003\n3. Tabellenprotokollierung - DT-P-AE-M01-004\n4. Arbeitslast-Monitor - DT-P-AE-M01-005\n5. Lesezugriffsprotokollierung - DT-P-AE-M01-006\n6. Benutzerinformationssystem - DT-P-AE-M01-007\n\nJeder Bereich dient der Extraktion und Analyse von Daten für verschiedene Aktivitäten, die im System stattfinden.\n\nHinweis: Jeder Bereich wird in seinem jeweiligen Maßnahme beschrieben.\n",
      "Verification": [
        "",
        "- Es wurde eine Richtlinie definiert und erstellt, um Informationen aus verschiedenen Protokolltools zu identifizieren, zu sammeln, zu erfassen und aufzubewahren",
        ""
      ],
      "References": [
        "- BSI APP.4.2 SAP-ERP-System, APP.4.2.A32 Echtzeiterfassung und Alarmierung von irregulären Vorgängen (H)"
      ]
    },
    {
      "Shortcode": "PT-P-DS-M01-005",
      "Security Function": "PT",
      "CSF Category": "Datensicherheit",
      "Technology": "SAP ABAP",
      "Maturity Level": "1",
      "IPAC": [
        "P"
      ],
      "Defender": [
        "Technologie"
      ],
      "Prerequisites": [
        ""
      ],
      "Description": "\nVerzeichnis-/Pfadüberquerungsangriffe können unbefugten Zugriff auf Dateien oder Verzeichnisse ermöglichen, indem Anwendungen manipuliert werden, die physische oder logische Dateinamen als Eingabe verwenden. Dadurch können Angreifer sensible/kritische Dateien lesen oder beschreiben, was zur Offenlegung von Informationen und anderen Angriffen führen kann, die das System weiter ausbeuten.\n",
      "Implementation": "\nDie folgenden Schritte helfen, Schwachstellen zu entschärfen, bei denen ein Angreifer Dateinamen manipulieren kann, um von verschiedenen Anwendungsservern zu lesen oder zu schreiben.\n\n- Aktualisieren Sie Ihren Kernel auf den neuesten Sicherheits-Patch-Level.\n- Überprüfen Sie alle logischen Dateinamen und Dateipfaddefinitionen aus den Listenprogrammen RSFILECR oder RSFILENA, um die erforderlichen Anpassungen zu ermitteln\n- Der Profilparameter abap/path_normalizartion sollte aktiviert sein (Wert 1).\n- Pfade müssen normalisiert werden (siehe SAP-Hinweis 1497003 zur Normalisierung von Dateipfaden), wenn das Berechtigungsobjekt S_DATASET verwendet wird\n- Pfade müssen normalisiert werden, wenn die Tabelle SPTH  Einträge enthält\n- Wenn die Benutzeroberflächen die Eingabe von logischen Dateinamen erlaubt, definieren Sie Aliase für die verwendeten logischen Dateinamen\n\nHinweis: Stellen Sie sicher, dass Sie die Änderungen zunächst in der Testumgebung implementieren, bevor Sie sie auf die Produktionssysteme anwenden. So vermeiden Sie Fehler oder Serviceunterbrechungen auf den Produktionssystemen.\n",
      "Verification": [
        "",
        "- Identifizieren Sie logische Dateinamen aus dem Listenprogramm RSFILENA",
        "- Identifizieren Sie logische Dateinamen und Dateipfaddefinitionen aus dem Listenprogramm RSFILECR",
        "- Überprüfen Sie, ob der Profilparameter abap/path_normalization nicht deaktiviert ist"
      ],
      "References": [
        "- BSI APP.4.2 SAP-ERP-System, APP.4.2.A1 Sichere Konfiguration des SAP-ABAP-Stacks (B) / Secure Konfiguration des SAP-ABAP-Stacks (B)",
        "- SAP Security Baseline Template V2.1: 2.2.1.3.1",
        "- SAP-Hinweis 1497003"
      ]
    },
    {
      "Shortcode": "PT-I-PT-M01-001",
      "Security Function": "PT",
      "CSF Category": "Schützende Technologie",
      "Technology": "Alle",
      "Maturity Level": "1",
      "IPAC": [
        "I"
      ],
      "Defender": [
        "Technologie"
      ],
      "Prerequisites": [],
      "Description": "\nSAP-Netzwerkimplementierungen sollten verwaltet, überwacht und kontrolliert werden, um Informationen in Anwendungen und Systemen zu schützen.\n\nDie Kontrolle beinhaltet die Notwendigkeit, den SAP Router und den Web Dispatcher sicher zu konfigurieren, damit sie als Gateways auf Anwendungsebene in der DMZ-Zone fungieren.\n",
      "Implementation": "\nExterner Verkehr:\n\nDer SAP-Router und der Web Dispatcher sollten in der demilitarisierten Zone (DMZ) betrieben werden, um den entsprechenden Datenverkehr zu filtern, bevor er durch eine weitere Firewall geleitet wird. \n\nInterner Verkehr:\n\nSAP-Systeme sollten in einem separaten Subnetz innerhalb des internen Netzwerks untergebracht werden. Dies ermöglicht eine einfachere Verwaltung von Netzwerkzugriffsrichtlinien für SAP-Systeme.\n\nKontrolle:\n\nDie Architektur von SAP-Systemen sollte ordnungsgemäß dokumentiert werden, einschließlich, aber nicht beschränkt auf Verbindungen, Kommunikation, Datenfluss, Benutzer und verwendete Protokolle.\n\n",
      "Verification": [
        "",
        "- SAP Router und Web Dispatcher werden in demilitarisierter Zone betrieben",
        "- ACLs sind eingerichtet, um unerwünschten Datenverkehr zu filtern.",
        "- Nur notwendige Ports dürfen auf das Netzwerk zugreifen.  ",
        "- SAP-Systeme befinden sich in einem separaten Subnetz innerhalb der Organisation",
        "- Dokumentation, die einen anschaulichen Überblick über die SAP-Architektur gibt"
      ],
      "References": [
        "- BSI APP.4.2 SAP-ERP-System, APP.4.2.A3 Netzwerksicherheit/ Netzsicherheit",
        "- CIS CSC 8, 12, 15",
        "- COBIT 5 DSS05.02, APO13.01",
        "- ISA 62443-3-3:2013 SR 3.1, SR 3.5, SR 3.8, SR 4.1, SR 4.3, SR 5.1, SR 5.2, SR 5.3, SR 7.1, SR 7.6",
        "- ISO/IEC 27001:2013 A.13.1.1, A.13.2.1, A.14.1.3",
        "- NIST SP 800-53 Rev. 4 AC-4, AC-17, AC-18, CP-8, SC-7, SC-19, SC-20, SC-21, SC-22, SC-23, SC-24, SC-25, SC-29, SC-32, SC-36, SC-37, SC- 38, SC-39, SC-40, SC-41, SC-43"
      ]
    },
    {
      "Shortcode": "IY-C-RA-M01-004",
      "Security Function": "IY",
      "CSF Category": "Risikobewertung",
      "Technology": "ABAP",
      "Maturity Level": "1",
      "IPAC": [
        "C"
      ],
      "Defender": [
        "Prozess"
      ],
      "Prerequisites": [],
      "Description": "\nPrävention von Injektionsschwachstellen\n\nInjektionsschwachstellen beziehen sich auf Situationen, in denen ein Angreifer Steuerzeichen und/oder Befehle über den Datenkanal (Eingabe) in eine Anwendung einschleust. Ein erfolgreicher Angriff kann sich durch unerwartete Befehle schädlich auf den geplanten Programmablauf auswirken.\nJe nach Art der Injektion kann ein Angreifer die vollständige Kontrolle über das betroffene SAP-System erlangen. Für die Programmiersprache ABAP umfasst dies insbesondere Implementierungen mit:\n- Zugriff auf das Dateisystem von Dateiservern oder von den SAP-Betriebssystemen zum Austausch oder zur Verarbeitung von Daten erfolgt. Mit der Anzahl der Schnittstellen (Anwendungen) steigt für jede einzelne Schnittstelle das Risiko, kompromittierte Daten zur Verarbeitung zu erhalten oder solche Daten durch fehlerhafte Eingaben selbst zu erzeugen.\n\n- Verwendung von Betriebssystembefehlen über ABAP-Programme. Der Systemzugriff erfolgt im Kontext des SAP-Systemdienstbenutzers. Dieser Benutzer verfügt notwendigerweise über weitreichende Privilegien im Betriebssystem. In Anbetracht des daraus resultierenden Gesamtrisikos sollte ABAP-Code, der Betriebssystembefehle ausführt, besonders geschützt werden.\n\n- Verwendung der dynamischen ABAP-Sprachfunktionen und des Datenbankzugriffs. Die Möglichkeiten zur Verwendung der dynamischen ABAP-Programmierung und des Zugriffs auf Datenbanken sind vielseitig einsetzbar. Sie sind jedoch auch mit besonderen Risiken verbunden. Wenn eine dynamische Programmierung notwendig ist, muss der Entwickler diesen Risiken durch besondere Schutzmaßnahmen Rechnung tragen.\n",
      "Implementation": "\n1. Im Rahmen der Änderungsprüfung muss das Design der Implementierung auf die folgenden Eigenschaften hin überprüft werden:\n    - Bei der Verarbeitung von Eingaben muss normalerweise eine ausreichende Plausibilitätsprüfung durchgeführt werden. Dies wird als \"Eingabevalidierung\" bezeichnet. Die Eingabevalidierung bietet nicht nur einen grundlegenden Sicherheitsschutz (da Steuerzeichen und Sonderzeichen in den meisten Datenfeldern unwirksam sind und entfernt werden können), sondern verbessert auch die Datenqualität im Allgemeinen. Die Eingabevalidierung sollte so implementiert werden, dass die Eingaben mit einer Liste zulässiger Werte verglichen werden, d.h. mit dem Ansatz des \"Allowlist-Filters\".\n    - Besondere Vorsicht ist geboten, wenn Benutzereingaben mit Steuerzeichen oder Sprachelementen (Semantik) vermischt werden und das Ergebnis dann als Ganzes verarbeitet oder ausgeführt wird. In diesem Fall müssen alle Steuerzeichen in den Daten, die im Kontext relevant sind, unschädlich gemacht werden. Dieser Vorgang wird je nach Ausgabekontext als \"Ausgabekodierung\" oder \"Sanitisierung\" bezeichnet.\n      Insbesondere die Umsetzung der folgenden Maßnahmen sollte validiert werden:\n      - Indirektion: Die Ausführung von kritischem Code sollte so weit wie möglich von der Eingabe entkoppelt werden\n      - Plausibilität: Bereichsprüfungen, Allowlists und/oder Denylists sollten verwendet werden, um den Wertebereich der Eingabe auf plausible Werte zu beschränken.\n      - Kontext-Validierung: Vor der Ausführung muss eine Kontrolllogik ablaufen, die die Ausführungsberechtigung des Programms, des Benutzers und der Eingabe ausreichend prüft.\n      - Nachvollziehbarkeit: Es sollte in Betracht gezogen werden, die Ausführung sensibler Geschäftslogik für den Kontext des Benutzers, die Ausführungszeit und die Eingabe ausreichend zu protokollieren.\n      - Äquivalenz: Bei dynamisch ausgeführtem Code muss das gleiche Maß an Kontrolle ablaufen wie bei einer gleichwertigen statischen Implementierung, die den im Falle einer korrekten statischen Implementierung der Codeausführung entspricht.\n\n2. Im Rahmen des Änderungstests müssen alle Implementierungen auf den Schutz vor eingabebasierten Angriffen überprüft werden, wenn geeignete ABAP-Techniken in der Implementierung verwendet werden.\n    - Traversierung von Verzeichnissen und Dateien.\n    - Injektion von Betriebssystembefehlen.\n    - SQL-Injektion.\n    - Ausprobier-Attacken.\n    - ABAP-Code-Injektion.\n",
      "Verification": [
        "",
        "- Prüfen Sie, ob für alle Änderungen am benutzerdefinierten Code eine Überprüfung des Quellcodes durchgeführt und dokumentiert wurde, um Schwachstellen bei Injektion und Bereinigung zu identifizieren.",
        "- Prüfen Sie, ob die Änderung ausreichend auf die oben genannten Sicherheitslücken getestet und dokumentiert wurde."
      ],
      "References": [
        "",
        "- CIS CSC 4",
        "- COBIT 5 APO12.01, APO12.02, APO12.03, APO12.04",
        "- ISA 62443-2-1:2009 4.2.3, 4.2.3.9, 4.2.3.12",
        "- ISO/IEC 27001:2013 Klausel 6.1.2",
        "- NIST SP 800-53 Rev. 4 RA-3, SI-5, PM-12, PM-16",
        "- OWASP ASVS 2.0 V5.1, V5.3",
        "- BSI APP (Februar 2020) 4.6 A7, A8, A11, A13, A18"
      ]
    },
    {
      "Shortcode": "PT-IP-PT-M01-001",
      "Security Function": "PT",
      "CSF Category": "Prozesse und Verfahren zum Schutz von Informationen",
      "Technology": "SAP GUI",
      "Maturity Level": "1",
      "IPAC": [
        "I",
        "P"
      ],
      "Defender": [
        "Prozess",
        "Technologie"
      ],
      "Prerequisites": [
        ""
      ],
      "Description": "\nSAP GUI ermöglicht es Benutzern, von ihren eigenen Workstations aus direkt auf verschiedene SAP-Anwendungen zuzugreifen. Diese Funktionalität stellt ein weiteres Sicherheitsrisiko für SAP-Anwendungen dar, wenn sie nicht gemäß den Sicherheitsrichtlinien verwaltet oder konfiguriert wird.\n",
      "Implementation": "\nSAP GUI wird laufend für verschiedene Probleme und Schwachstellen aktualisiert. Daher ist es sehr wichtig, Updates für SAP GUI in die Patch-Zyklen des Unternehmens aufzunehmen.\n\n- Regelmäßige Aktualisierung der SAP GUI für alle Clients\n\nHinweis: PT-IP-PT-M01-002 enthält detaillierte Informationen zur Sicherung der SAP GUI\n",
      "Verification": [
        "",
        "- Überprüfen Sie, ob SAP GUI in die Patch-Verwaltung des Unternehmens einbezogen ist.",
        "- Überprüfen Sie, ob die SAP GUI auf den Client-PCs aktuell ist."
      ],
      "References": [
        "- BSI APP.4.2 SAP-ERP-System, APP.4.2.A20 Sichere SAP-GUI-Einstellungen/ Sichere SAP-GUI-Einstellungen",
        "- SAP Security Baseline Template V2.1: 2.2.2.1.4"
      ]
    },
    {
      "Shortcode": "DT-P-AE-M01-004",
      "Security Function": "DT",
      "CSF Category": "Anomalien und Ereignisse",
      "Technology": "SAP ERP",
      "Maturity Level": "1",
      "IPAC": [
        "P"
      ],
      "Defender": [
        "Prozess"
      ],
      "Prerequisites": [],
      "Description": "\nTabellenprotokollierung:\n\nDie Identifizierung und Sammlung von Protokollen zur Ermittlung von Änderungen in kritischen Tabellen ist notwendig, um die Integrität der in verschiedenen Tabellen verfügbaren Daten zu erhalten.\n\n",
      "Implementation": "\nAktivieren Sie die Tabellenprotokollierung über den Profilparameter rec/client. Es wird empfohlen, diesen Parameter so einzustellen, dass die Protokollierung von allen Mandanten innerhalb Ihrer SAP-Umgebung erfolgt.\n\nAls Faustregel gilt: Wählen Sie Tabellen aus, die entweder mit der höchsten Schutzklasse klassifiziert sind, oder wählen Sie Tabellen je nach der Kritikalität der darin enthaltenen Daten.\n\nSie können Warnmeldungen konfigurieren, wenn ein bestimmtes Ereignis eintritt oder ein Schwellenwert erreicht wird. Dies trägt dazu bei, den Überprüfungsprozess der Tabellenprotokolle zu automatisieren und die Arbeitsbelastung der Administratoren zu verringern. Das Versenden von Protokollen an eine zentrale Stelle hilft bei der Einrichtung von Warnmeldungen.\n",
      "Verification": [
        "",
        "- Stellen Sie den Parameter rec/client so ein, dass die Protokollierung aktiviert wird.",
        "- Setzen Sie den rec/client-Parameter, um von allen Clients zu sammeln",
        "- Definieren Sie die zu protokollierenden Tabellen mit der Transaktion SE13",
        "- Verwenden Sie Transaktion SCU3, um einen Überblick über alle Tabellen zu erhalten, für die die Tabellenprotokollierung aktiviert ist, sowie über die Änderungen an diesen Tabellen",
        "- Konfigurieren Sie Alarme für wichtige Ereignisse, um auf Änderungen in den Tabellen zu reagieren"
      ],
      "References": []
    },
    {
      "Shortcode": "PT-A-AC-M01-012",
      "Security Function": "PT",
      "CSF Category": "Benutzerverwaltung, Authentifizierung und Zugriffskontrolle",
      "Technology": "SAP Java",
      "Maturity Level": "1",
      "IPAC": [
        "A"
      ],
      "Defender": [
        "Technologie"
      ],
      "Prerequisites": [],
      "Description": "\nEs wird empfohlen, Single Sign-On (SSO) zu konfigurieren, wenn mehrere SAP-Systeme in der Umgebung des Unternehmens laufen. SSO kann den Prozess der Verwaltung und Konfiguration von Benutzerberechtigungen für mehrere Systeme und Anwendungen vereinfachen. Einem einzelnen Benutzer den Zugriff auf mehrere Anwendungen zu gestatten, birgt eigene Sicherheitsrisiken und Bedrohungen; eine sichere Konfiguration der ausgestellten Anmeldetickets muss vorhanden sein, um potenzielle Bedrohungen zu vermeiden.  \n",
      "Implementation": "\nUm ausgestellte Anmeldetickets während des Transports in Java-basierten Systemen zu schützen, müssen die folgenden Profilparameter vorhanden sein.  \n\n- Verwenden Sie HTTPS, indem Sie ume.logon.security.enforce_secure_cookie = true setzen.\n- Legen Sie ein Ablaufdatum für das ausgestellte Ticket fest, indem Sie login.ticket_lifetime ≤ 8 (hh:mm) setzen.\n- Deklarieren Sie ein Cookie als HTTPonly, indem Sie ume.logon.httponlycookie = true setzen. Dadurch wird der Zugriff auf das ausgestellte Cookie vom Webbrowser des Clients durch andere Anwendungen wie z.B. Javascript-Zugriff, Plug-ins usw. verhindert.\n\n\nHinweis: Diese Kontrolle setzt voraus, dass SSO in der Organisation bereits konfiguriert ist und verwendet wird.\n",
      "Verification": [
        "",
        "- Überprüfen Sie, ob der HTTPS-Profilparameter gesetzt ist, indem Sie ume.logon.security.enforce_secure_cookie = true überprüfen.",
        "- Überprüfen Sie, ob ein Ablaufdatum für ausgestellte Anmeldetickets existiert, indem Sie login.ticket_lifetime ≤ 8 überprüfen.",
        "- Prüfen Sie, ob der Profilparameter ume.logon.httponlycookie = true"
      ],
      "References": [
        "- BSI APP.4.2 SAP-ERP-System, APP.4.2.A31 Konfiguration von SAP Single-Sign-On (S) / Konfiguration von SAP Single-Sign-On (S)",
        "- SAP Security Baseline Template V2.1: 2.3.2.4.2"
      ]
    },
    {
      "Shortcode": "PT-I-IP-M01-006",
      "Security Function": "PT",
      "CSF Category": "Prozesse und Verfahren zum Schutz von Informationen",
      "Technology": "SAP ABAP",
      "Maturity Level": "1",
      "IPAC": [
        "I"
      ],
      "Defender": [
        "Prozess"
      ],
      "Prerequisites": [],
      "Description": "\nDie Verwaltung von RFC-Verbindungen zwischen verschiedenen Systemen mit unterschiedlichen Klassifizierungsstufen ist erforderlich, um die Ausweitung von Rechten auf sensible oder Produktionssysteme zu verhindern.\n",
      "Implementation": "\nAls Faustregel gilt, dass Verbindungen von Systemen niedrigerer Klassifizierung, wie z.B. Entwicklungs- oder Testsystemen, zu Systemen hoher Klassifizierung, wie z.B. Produktionssystemen, keine Vertrauensstellungen (Trust Relations) zur Systemanmeldung verwenden oder Benutzeranmeldedaten des Zielsystems speichern sollten.\nDie Daten der Verbindungskonfiguration sind das einzige, was in den verschiedenen Systemen gespeichert werden kann. Entsprechend muss die Anmeldung mittels des jeweiligen Benutzers im Zielsystem durch Authentifizierung erfolgen.\n\n",
      "Verification": [
        "",
        "- Authentifizierung ist bei jeder Verbindung von einem niedrigeren zu einem höheren Klassifizierungssystem erforderlich",
        "- Um RFC-Verbindungen zu ermitteln, die Benutzer-Credentials speichern, verwenden Sie den Report RSRFCCHK in allen Systemen lokal",
        "- Schränken Sie die Berechtigung zur Pflege von RFC-Destinationen in Transaktion SM59 ein, indem Sie das Berechtigungsobjekt S_RFC_ADM streng kontrollieren."
      ],
      "References": [
        "- BSI APP.4.2 SAP-ERP-System, APP.4.2.A8 Absicherung der SAP-RFC-Schnittstelle/ Absicherung der SAP-RFC-Schnittstelle",
        "- SAP Security Baseline Template V2.0: 2.3.2.3"
      ]
    },
    {
      "Shortcode": "PT-P-PT-M01-009",
      "Security Function": "PT",
      "CSF Category": "Schutztechnologie",
      "Technology": "SAP ABAP",
      "Maturity Level": "1",
      "IPAC": [
        "P"
      ],
      "Defender": [
        "Technologie"
      ],
      "Prerequisites": [],
      "Description": "\nDer Schutz vor böswilligem oder unerkanntem Zugriff auf die Anwendungsserver über den Message Server ist entscheidend für die Aufrechterhaltung der Integrität, Verfügbarkeit und Vertraulichkeit der verschiedenen Anfragen zwischen den Anwendungsservern eines SAP-System, dass in Form eines Clusters betrieben wird.\n",
      "Implementation": "\nEin Netzwerkgerät, das als abtrünniger Anwendungsserver fungiert, kann ein hohes Risiko für das Unternehmen darstellen, wenn die Kommunikation mit legitimen Anwendungsservern zugelassen wird..\n\nFür den Message Server müssen Zugriffskontrolllisten (ACLs) konfiguriert werden, um Angriffe auf die Vertrauensstellung zwischen legitimen Anwendungsservern einzudämmen und abzuwehren.\n\n- ACL-Datei sollte keinen Eintrag enthalten, der alle Hosts zulässt (d.h. HOST=* ist kritisch)\n- Trennen Sie die Ports auf dem Message-Server für interne (1) und externe Kommunikation (2)\n- Profilparameter rdisp/msserv_internal definiert die zu verwendenden internen Ports\n- Unterbinden der Kommunikation von anderen Netzwerkgeräten zu dem im Profilparameter rdisp/msserv_internal definierten Port\n- Externe Überwachung des Message Servers durch Setzen des Profilparameters ms/monitor=0 unterbinden\n- Externe Verwaltung des Message Servers durch Setzen des Profilparameters ms/admin_port=0 verbieten\n\n(1) - Interne Kommunikation dient der Kommunikation zwischen verschiedenen Anwendungsdiensten im Unternehmen\n\n(2) - Externe Kommunikation dient der Kommunikation mit den Benutzern/Kunden\n",
      "Verification": [
        "",
        "- Überprüfen Sie die ACLs für den Message Server anhand des Profilparameters ms/acl_info",
        "- Überprüfen Sie, dass HOST=* nicht in der ACL definiert ist.",
        "- Überprüfen Sie, ob die Ports für internen und externen Datenverkehr aufgeteilt sind und ob die Firewall die Kommunikation zum internen Port für alle Hosts blockiert, die nicht zum Systemcluster gehören.",
        "- Überprüfen Sie, dass der Profilparameter ms/monitor=0 ist.",
        "- Überprüfen Sie, ob der Profilparameter ms/admin_port=0 ist."
      ],
      "References": [
        "- BSI APP.4.2 SAP-ERP-System, APP.4.2.A9 Absicherung und Überwachung des Message-Servers (B) / Protection and monitoring of the Message-Servers (B)",
        "- SAP Security Baseline Template V2.1: 2.2.1.4, 2.2.1.4.1, 2.2.1.4.2"
      ]
    }
  ],
  "Requirements": []
}
